[
    {
        "data": {
            "world": [
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "Controlling territory is a key part of Islamic State strategy because it feeds the group's caliphate rhetoric, which attracts foreign fighters. Instead of staying to defend the region, Islamic State fighters redoubled offensives on other front lines. In November, Kurdish and Yazidi fighters gained control of Sinjar, in Iraq, and of parts of a strategic road between Syria and Iraq. Islamic State had some of its most significant losses in northern Syria. Territory is also a major source of revenue from taxes and fines that the group imposes.", 
                    "link": "http://www.nytimes.com/interactive/2015/12/18/world/middleeast/Where-ISIS-Gained-and-Lost-Territory-Islamic-State.html", 
                    "title": "Where ISIS Gained and Lost Territory This Year", 
                    "date": "2015-12-20", 
                    "summary": "Controlling territory is a key part of Islamic State strategy because it feeds the group's caliphate..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "About 10 American officers serve on the ship under French command as exchange officers or in other capacities. French officers said that pilots who are preparing for a mission avoid alcohol. The Persian Gulf is not new to the French Navy, which has maintained a quasi-permanent presence in these waters and the Indian Ocean, Commander Delort said. But the Paris attacks have made fighting the Islamic State the carriers main business. Years of quiet cooperation between the American Navy and Frances Marine nationale made it possible for the Charles de Gaulle to take a turn at spearheading the task force.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/europe/french-ship-is-in-lead-in-strikes-against-isis.html", 
                    "title": "French Ship Commands Naval Task Force in Strikes Against ISIS", 
                    "date": "2015-12-20", 
                    "summary": "About 10 American officers serve on the ship under French command as exchange officers or in other c..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "Abdul Wahab al-Humigani, a government negotiator writing on Facebook, blamed the collapse of the talks on the Houthis intransigence, including on the issue of releasing prisoners. The United Nations-brokered talks, which began on Tuesday, were aimed at ending the nine-month war between Yemens Houthi rebels and the government of President Abdu Rabbu Mansour Hadi. Human rights groups say that bombing by the coalition is responsible for the majority of civilian deaths during the war. The Houthis had asked for the formation of a new government from across the political spectrum, and elections within a year, he added. In recent days, anti-Houthi fighters have mounted a broad offensive across several northern provinces, and captured new territory, including a provincial capital.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/middleeast/yemen-peace-talks-end-with-no-end-to-conflict.html", 
                    "title": "Yemen Peace Talks End With No End to Conflict", 
                    "date": "2015-12-20", 
                    "summary": "Abdul Wahab al-Humigani, a government negotiator writing on Facebook, blamed the collapse of the tal..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "It was unlikely that the members of the opposition council would have much popular support, because many of them had controversial pasts, Mr. The opposition council was also critical of how the coalition government has handled the security situation. Several of them are also believed to have been involved in the embezzlement and corruption that plagued the former government. Mr. If the election doesnt take place in time, or is delayed, then people will try to look for alternatives, Mr.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/asia/afghan-government-faces-new-set-of-rivals.html", 
                    "title": "Afghan Government Faces New Set of Rivals", 
                    "date": "2015-12-20", 
                    "summary": "It was unlikely that the members of the opposition council would have much popular support, because ..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "Articles in this series examine the rise of the Islamic State and life inside the territory it has conquered.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/middleeast/isis-recruitment-killer-hassan-aboud.html", 
                    "title": "Behind the Black Flag: The Recruitment of an ISIS Killer", 
                    "date": "2015-12-20", 
                    "summary": "Articles in this series examine the rise of the Islamic State and life inside the territory it has c..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "Norfolk Southern has repeatedly repudiated the offer, largely out of concern that regulators would not approve a deal. The fallout from that consolidation spurred new rules in 2001 to make rail mergers harder by denying potential acquisitions that could cause a domino effect. When Union Pacific was integrating Southern Pacific, computer problems resulted in lost or delayed cargo. Canadian Pacific has made three attempts  the latest one last week  to acquire Norfolk Southern in what could be a $27 billion deal. Ackman argue that railroads, especially Norfolk Southern, need to improve their operating efficiency and that the best way to do that is by combining.", 
                    "link": "http://www.nytimes.com/2015/12/21/business/dealbook/regulations-doubts-and-concerns-may-thwart-railway-mergers.html", 
                    "title": "Regulations, Doubts and Concerns May Thwart Railway Mergers", 
                    "date": "2015-12-20", 
                    "summary": "Norfolk Southern has repeatedly repudiated the offer, largely out of concern that regulators would n..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "But the fact that terrorists appear to have entered Europe concealed among asylum seekers still vindicated repeated warnings by Mr. Orban  that most of the asylum seekers entering Europe were not Syrians fleeing war but economic migrants seeking jobs. Mr. They are xenophobes and Nazis, Zoltan Kovacs, a government spokesman, said. Suddenly, it turns out that what we said was true. Orbans positions, European leaders have nonetheless begun to echo him on many points, albeit without his nasty snarls.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/europe/hungary-viktor-orban-migrant-crisis.html", 
                    "title": "Hungary’s Migrant Stance, Once Denounced, Gains Some Acceptance", 
                    "date": "2015-12-20", 
                    "summary": "But the fact that terrorists appear to have entered Europe concealed among asylum seekers still vind..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "One senior European Union official agreed, though he was morose rather than gleeful about the prospect. Something like this is needed because, otherwise, there is a risk that the European Union could disintegrate. Its latest series of problems has fueled right-wing populism, which feeds off the idea that the European Union already has too much influence. The European Union is doing a poor job of managing its multiple crises. With the euro crisis, there is a decentralized alternative based on using the discipline of markets rather than rules.", 
                    "link": "http://www.nytimes.com/2015/12/21/business/international/in-eu-crises-a-decentralized-alternative.html", 
                    "title": "In E.U. Crises, a Decentralized Alternative", 
                    "date": "2015-12-20", 
                    "summary": "One senior European Union official agreed, though he was morose rather than gleeful about the prospe..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "Her lawyers and international human rights groups warned that she was not receiving proper medical treatment for a gunshot wound she received at a protest. Tens of thousands of perceived government opponents have been imprisoned and are facing trials in courts that human rights advocates say are seldom inclined to deliver justice. In many other cases, the Egyptian authorities have shrugged off the pressure to release prisoners or dismissed it as interference in the judicial process. Taweel appears to have benefited from an unusual burst of public pressure that human rights advocates say may be the only way to loosen the grip of the Egyptian authorities. CAIRO  The Egyptian government took the unusual step on Sunday of releasing a 23-year-old student held on charges of belonging to a banned Islamist movement, in a rare bow to public pressure after photos of the student sobbing and hobbling on crutches went viral on social media.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/middleeast/egypt-releases-esraa-al-taweel-cairo.html", 
                    "title": "Egypt Releases Student in a Rare Bow to Public Pressure", 
                    "date": "2015-12-20", 
                    "summary": "Her lawyers and international human rights groups warned that she was not receiving proper medical t..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "Monpas, both archivists for the City of Paris, this was not the usual fare of musty public records and old administrative documents. At the Paris archives, in the 19th arrondissement, the documents will undergo a long and meticulous conservation process. Mr. Instead, they were sifting through some of the tens of thousands of letters, drawings and other tokens of grief that have been left at makeshift memorials after the Nov. 13 attacks that killed 130 people. This time, the City of Paris quickly mounted an effort to archive the material from Nov. 13, which will prove valuable to sociologists and historians.", 
                    "link": "http://www.nytimes.com/2015/12/21/arts/design/in-paris-archivists-preserve-tokens-of-grief.html", 
                    "title": "In Paris, Archivists Preserve Tokens of Grief", 
                    "date": "2015-12-20", 
                    "summary": "Monpas, both archivists for the City of Paris, this was not the usual fare of musty public records a..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "Sellarss new production  his first opera at the Philharmonie  is necessarily sparse, and billed only as a semi-staged opera. He had conducted this orchestra in this opera before, in Salzburg and Berlin in 2006. Christian Gerhaher is an exquisite Pellas, while his brother and Mlisandes husband, Golaud, is made brutal, sarcastic and embittered by Gerald Finley. Sellarss staging completely captures the human essence of Maurice Maeterlincks play, a love triangle of both ethereal delicacy and shocking violence. Mr.", 
                    "link": "http://www.nytimes.com/2015/12/21/arts/music/review-berlin-philharmonics-pelleas-et-melisande-boldly-stretches-boundaries.html", 
                    "title": "Review: Berlin Philharmonic’s ‘Pelléas et Mélisande’ Boldly Stretches Boundaries", 
                    "date": "2015-12-20", 
                    "summary": "Sellarss new production  his first opera at the Philharmonie  is necessarily sparse, and billed only..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "The official, Silvan Shalom, the Israeli interior minister and deputy prime minister, has denied the allegations. JERUSALEM  A top official in Prime Minister Benjamin Netanyahus government who has been accused of sexual misconduct said on Sunday that he would step down. He is the latest Israeli public figure to be accused of sexual misconduct. Shalom is one of Israels best-known politicians and had previously served as foreign minister and finance minister.  In May, Ehud Olmert, a former prime minister who was forced from office over allegations of corruption, was sentenced to eight months in jail for fraud and breach of trust in a case involving an American businessman.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/middleeast/israel-silvan-shalom-resignation.html", 
                    "title": "Israeli Minister Accused of Sexual Misconduct to Resign", 
                    "date": "2015-12-20", 
                    "summary": "The official, Silvan Shalom, the Israeli interior minister and deputy prime minister, has denied the..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "In the decades since the civil war, there hasnt been any public reckoning of the ruptures that led to it. Before the first coup, during the civil war, and after, Igbos have felt the threat of economic, social and political marginalization. A civil war ensued. The new pro-Biafran protests are led by youth who have little memory of Biafra or the brutality and horror of the civil war. There are no national memorials, except for the poorly funded and run-down National War Museum in Umuahia, a city in the former Republic of Biafra.", 
                    "link": "http://www.nytimes.com/2015/12/21/opinion/facing-down-nigerias-ghosts.html", 
                    "title": "Facing Down Nigeria’s Ghosts", 
                    "date": "2015-12-20", 
                    "summary": "In the decades since the civil war, there hasnt been any public reckoning of the ruptures that led t..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "In October, a building collapsed in the central province of Henan, killing at least 17 construction workers. A section of a major pipeline that transports natural gas from Chinas west exploded as the landslide struck, Xinhua reported. The number of people reported missing climbed earlyMondayto 91, the official Xinhua News Agency reported. A landslide in May in southwestern Guizhou Province caused a nine-story building to collapse, killing 16 people. About 1,500 rescue workers were searching the rubble, according to a report on the official page of the Guangming New District government on Sina Weibo, Chinas Twitter-like social media site.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/asia/landslide-hits-southern-city-sending-hundreds-fleeing-china-reports.html", 
                    "title": "Landslide Hits Southern City, Sending Hundreds Fleeing, China Reports", 
                    "date": "2015-12-20", 
                    "summary": "In October, a building collapsed in the central province of Henan, killing at least 17 construction ..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "The commander, Samir Kuntar, was freed as part of an exchange that returned the bodies of two soldiers to Israel. RAMALLAH, West Bank  A Hezbollah commander whom Israel reluctantly released in 2008  nearly 30 years after he took part in a notorious terrorist attack  was killed in an airstrike in Syria, Hezbollah and his family said on Sunday. Hezbollah, a Shiite militia and political movement, blamed Israel for the assault, but Israeli officials had no comment. Al Manar praised him Sunday morning as the dean of Arab detainees.The devastating 2006 war between Israel and Hezbollah began, in a way, because of him. When asked if Israel had those capabilities, he responded: Israel is one of the leaders.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/middleeast/samir-kuntar-hezbollah-syria-israel.html", 
                    "title": "Commander of Hezbollah Freed by Israel Is Killed in Syria", 
                    "date": "2015-12-20", 
                    "summary": "The commander, Samir Kuntar, was freed as part of an exchange that returned the bodies of two soldie..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "Air France Flight 463 was headed from the island of Mauritius to Paris when a passenger noticed the suspicious device. The scare was the latest incident to affect Air France and other airlines in recent weeks amid heightened concerns of potential terrorist threats to air travel in the wake of the Oct. 31 crash of the Russian airliner. NAIROBI  An Air France jetliner flying over the Indian Ocean made an emergency landing in Kenya on Sunday after a suspicious device found in a bathroom turned out to be constructed of cardboard and made to look like a bomb. The passenger notified the crew, who alerted the captain, Kenyan officials said, and the plane then diverted from its flight path and made an emergency landing in the Kenyan coastal city of Mombasa shortly after midnight Sunday. Egyptian investigators, however, say they have so far uncovered no evidence proving the plane was brought down by a bomb.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/africa/air-france-emergency-landing-kenya-device.html", 
                    "title": "French Airliner Makes Emergency Landing in Kenya After ‘False Alarm’", 
                    "date": "2015-12-20", 
                    "summary": "Air France Flight 463 was headed from the island of Mauritius to Paris when a passenger noticed the ..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": " Garcia Godoy to discuss the violence of the past 24 hours. New York Herald Tribune, European Edition, December 21, 1965 Francisco Caamano Deno as automatic arms fire continued to crackle throughout the city after weekend fighting that claimed at least nine lives. Caamano Deno went to the presidential palace and met with Mr. SANTO DOMINGO  Gunmen today [Dec . 20] machine-gunned the residence of civil war rebel leader Col. But the new fighting was seen as a severe blow to the rule of provisional President Hector Garcia Godoy, who only last week announced that rebel troops would be reintegrated into the Dominican armed forces.", 
                    "link": "http://iht-retrospective.blogs.nytimes.com/2015/12/20/1965-fighting-continues-in-dominican-republic/", 
                    "title": "1965: Fighting Continues in Dominican Republic", 
                    "date": "2015-12-20", 
                    "summary": " Garcia Godoy to discuss the violence of the past 24 hours. New York Herald Tribune, European Editio..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "Official figures from July to Dec. 14 reveal that 12,091 bodies  2,998 adults and 9,093 children  have been found in Shanghais streets.  Since the severest cold here is just beginning, death figures will increase in the remaining winter months.New York Herald Tribune, European Edition, December 21, 1940 SHANGHAI  A homeless, elderly Chinese beggar who made his bed last night [Dec. 19] in an empty coffin in the French Concession was found dead this morning as a result of exposure. Of this number 398 adults and 691 children were found dead in the first two weeks of this month. High cost of living and general unemployment, largely caused by war conditions, are responsible for this tragic situation.", 
                    "link": "http://iht-retrospective.blogs.nytimes.com/2015/12/20/1940-extreme-cold-weather-in-shanghai-claims-hundreds-of-lives/", 
                    "title": "1940: Extreme Cold Weather in Shanghai Claims Hundreds of Lives", 
                    "date": "2015-12-20", 
                    "summary": "Official figures from July to Dec. 14 reveal that 12,091 bodies  2,998 adults and 9,093 children  ha..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "MADRID  The conservative governing party won the most votes on Sunday, but lost its majority in parliamentary elections that underlined the fragmentation of Spanish politics and left the countrys future leadership unclear. In October, a center-right coalition won the most votes in Portugals elections, but it was then ousted from office in a parliamentary vote after Mr. Podemos was formed early last year as a far-left, anti-austerity party, modeled in part on the success of Syriza, the governing party in Greece. Rajoys Popular Party won 123 of the 350 parliamentary seats, down from 186 seats in the last elections, in 2011, according to the results with nearly all of the votes counted. Before Sundays vote, the leaders of Spains main parties had hinted at possible coalition partnerships, without firmly committing to any.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/europe/spain-election-rajoy-citizens-podemos.html", 
                    "title": "Governing Party Loses Majority in Spanish Parliamentary Vote", 
                    "date": "2015-12-20", 
                    "summary": "MADRID  The conservative governing party won the most votes on Sunday, but lost its majority in parl..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "Now, as it seeks to expand its audience globally, Axel Springer has moved aggressively to increase its portfolio. Peters, 50, is poised to become one of the next Axel Springer managers to more fully embrace the groups digital future. In addition to the financial investment, Axel Springers main real estate portal, Immonet, formed a joint marketing partnership with Airbnb in Germany. In the summer of 2012, he sent three of Axel Springers most senior managers to California for nine months. Nonetheless, Axel Springer, a family-controlled empire with deep ties to Germanys political establishment, has shown a willingness to place more opportunistic bets as well.", 
                    "link": "http://www.nytimes.com/2015/12/21/business/media/an-old-media-empireaxel-springer-reboots-for-the-digital-age.html", 
                    "title": "An Old-Media Empire, Axel Springer Reboots for the Digital Age", 
                    "date": "2015-12-20", 
                    "summary": "Now, as it seeks to expand its audience globally, Axel Springer has moved aggressively to increase i..."
                }
            ],

            "politics": [
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "Controlling territory is a key part of Islamic State strategy because it feeds the group's caliphate rhetoric, which attracts foreign fighters. Instead of staying to defend the region, Islamic State fighters redoubled offensives on other front lines. In November, Kurdish and Yazidi fighters gained control of Sinjar, in Iraq, and of parts of a strategic road between Syria and Iraq. Islamic State had some of its most significant losses in northern Syria. Territory is also a major source of revenue from taxes and fines that the group imposes.", 
                    "link": "http://www.nytimes.com/interactive/2015/12/18/world/middleeast/Where-ISIS-Gained-and-Lost-Territory-Islamic-State.html", 
                    "title": "Where ISIS Gained and Lost Territory This Year", 
                    "date": "2015-12-20", 
                    "summary": "Controlling territory is a key part of Islamic State strategy because it feeds the group's caliphate..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "About 10 American officers serve on the ship under French command as exchange officers or in other capacities. French officers said that pilots who are preparing for a mission avoid alcohol. The Persian Gulf is not new to the French Navy, which has maintained a quasi-permanent presence in these waters and the Indian Ocean, Commander Delort said. But the Paris attacks have made fighting the Islamic State the carriers main business. Years of quiet cooperation between the American Navy and Frances Marine nationale made it possible for the Charles de Gaulle to take a turn at spearheading the task force.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/europe/french-ship-is-in-lead-in-strikes-against-isis.html", 
                    "title": "French Ship Commands Naval Task Force in Strikes Against ISIS", 
                    "date": "2015-12-20", 
                    "summary": "About 10 American officers serve on the ship under French command as exchange officers or in other c..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "Abdul Wahab al-Humigani, a government negotiator writing on Facebook, blamed the collapse of the talks on the Houthis intransigence, including on the issue of releasing prisoners. The United Nations-brokered talks, which began on Tuesday, were aimed at ending the nine-month war between Yemens Houthi rebels and the government of President Abdu Rabbu Mansour Hadi. Human rights groups say that bombing by the coalition is responsible for the majority of civilian deaths during the war. The Houthis had asked for the formation of a new government from across the political spectrum, and elections within a year, he added. In recent days, anti-Houthi fighters have mounted a broad offensive across several northern provinces, and captured new territory, including a provincial capital.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/middleeast/yemen-peace-talks-end-with-no-end-to-conflict.html", 
                    "title": "Yemen Peace Talks End With No End to Conflict", 
                    "date": "2015-12-20", 
                    "summary": "Abdul Wahab al-Humigani, a government negotiator writing on Facebook, blamed the collapse of the tal..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "It was unlikely that the members of the opposition council would have much popular support, because many of them had controversial pasts, Mr. The opposition council was also critical of how the coalition government has handled the security situation. Several of them are also believed to have been involved in the embezzlement and corruption that plagued the former government. Mr. If the election doesnt take place in time, or is delayed, then people will try to look for alternatives, Mr.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/asia/afghan-government-faces-new-set-of-rivals.html", 
                    "title": "Afghan Government Faces New Set of Rivals", 
                    "date": "2015-12-20", 
                    "summary": "It was unlikely that the members of the opposition council would have much popular support, because ..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "Articles in this series examine the rise of the Islamic State and life inside the territory it has conquered.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/middleeast/isis-recruitment-killer-hassan-aboud.html", 
                    "title": "Behind the Black Flag: The Recruitment of an ISIS Killer", 
                    "date": "2015-12-20", 
                    "summary": "Articles in this series examine the rise of the Islamic State and life inside the territory it has c..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "Norfolk Southern has repeatedly repudiated the offer, largely out of concern that regulators would not approve a deal. The fallout from that consolidation spurred new rules in 2001 to make rail mergers harder by denying potential acquisitions that could cause a domino effect. When Union Pacific was integrating Southern Pacific, computer problems resulted in lost or delayed cargo. Canadian Pacific has made three attempts  the latest one last week  to acquire Norfolk Southern in what could be a $27 billion deal. Ackman argue that railroads, especially Norfolk Southern, need to improve their operating efficiency and that the best way to do that is by combining.", 
                    "link": "http://www.nytimes.com/2015/12/21/business/dealbook/regulations-doubts-and-concerns-may-thwart-railway-mergers.html", 
                    "title": "Regulations, Doubts and Concerns May Thwart Railway Mergers", 
                    "date": "2015-12-20", 
                    "summary": "Norfolk Southern has repeatedly repudiated the offer, largely out of concern that regulators would n..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "But the fact that terrorists appear to have entered Europe concealed among asylum seekers still vindicated repeated warnings by Mr. Orban  that most of the asylum seekers entering Europe were not Syrians fleeing war but economic migrants seeking jobs. Mr. They are xenophobes and Nazis, Zoltan Kovacs, a government spokesman, said. Suddenly, it turns out that what we said was true. Orbans positions, European leaders have nonetheless begun to echo him on many points, albeit without his nasty snarls.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/europe/hungary-viktor-orban-migrant-crisis.html", 
                    "title": "Hungary’s Migrant Stance, Once Denounced, Gains Some Acceptance", 
                    "date": "2015-12-20", 
                    "summary": "But the fact that terrorists appear to have entered Europe concealed among asylum seekers still vind..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "One senior European Union official agreed, though he was morose rather than gleeful about the prospect. Something like this is needed because, otherwise, there is a risk that the European Union could disintegrate. Its latest series of problems has fueled right-wing populism, which feeds off the idea that the European Union already has too much influence. The European Union is doing a poor job of managing its multiple crises. With the euro crisis, there is a decentralized alternative based on using the discipline of markets rather than rules.", 
                    "link": "http://www.nytimes.com/2015/12/21/business/international/in-eu-crises-a-decentralized-alternative.html", 
                    "title": "In E.U. Crises, a Decentralized Alternative", 
                    "date": "2015-12-20", 
                    "summary": "One senior European Union official agreed, though he was morose rather than gleeful about the prospe..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "Her lawyers and international human rights groups warned that she was not receiving proper medical treatment for a gunshot wound she received at a protest. Tens of thousands of perceived government opponents have been imprisoned and are facing trials in courts that human rights advocates say are seldom inclined to deliver justice. In many other cases, the Egyptian authorities have shrugged off the pressure to release prisoners or dismissed it as interference in the judicial process. Taweel appears to have benefited from an unusual burst of public pressure that human rights advocates say may be the only way to loosen the grip of the Egyptian authorities. CAIRO  The Egyptian government took the unusual step on Sunday of releasing a 23-year-old student held on charges of belonging to a banned Islamist movement, in a rare bow to public pressure after photos of the student sobbing and hobbling on crutches went viral on social media.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/middleeast/egypt-releases-esraa-al-taweel-cairo.html", 
                    "title": "Egypt Releases Student in a Rare Bow to Public Pressure", 
                    "date": "2015-12-20", 
                    "summary": "Her lawyers and international human rights groups warned that she was not receiving proper medical t..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "Monpas, both archivists for the City of Paris, this was not the usual fare of musty public records and old administrative documents. At the Paris archives, in the 19th arrondissement, the documents will undergo a long and meticulous conservation process. Mr. Instead, they were sifting through some of the tens of thousands of letters, drawings and other tokens of grief that have been left at makeshift memorials after the Nov. 13 attacks that killed 130 people. This time, the City of Paris quickly mounted an effort to archive the material from Nov. 13, which will prove valuable to sociologists and historians.", 
                    "link": "http://www.nytimes.com/2015/12/21/arts/design/in-paris-archivists-preserve-tokens-of-grief.html", 
                    "title": "In Paris, Archivists Preserve Tokens of Grief", 
                    "date": "2015-12-20", 
                    "summary": "Monpas, both archivists for the City of Paris, this was not the usual fare of musty public records a..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "Sellarss new production  his first opera at the Philharmonie  is necessarily sparse, and billed only as a semi-staged opera. He had conducted this orchestra in this opera before, in Salzburg and Berlin in 2006. Christian Gerhaher is an exquisite Pellas, while his brother and Mlisandes husband, Golaud, is made brutal, sarcastic and embittered by Gerald Finley. Sellarss staging completely captures the human essence of Maurice Maeterlincks play, a love triangle of both ethereal delicacy and shocking violence. Mr.", 
                    "link": "http://www.nytimes.com/2015/12/21/arts/music/review-berlin-philharmonics-pelleas-et-melisande-boldly-stretches-boundaries.html", 
                    "title": "Review: Berlin Philharmonic’s ‘Pelléas et Mélisande’ Boldly Stretches Boundaries", 
                    "date": "2015-12-20", 
                    "summary": "Sellarss new production  his first opera at the Philharmonie  is necessarily sparse, and billed only..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "The official, Silvan Shalom, the Israeli interior minister and deputy prime minister, has denied the allegations. JERUSALEM  A top official in Prime Minister Benjamin Netanyahus government who has been accused of sexual misconduct said on Sunday that he would step down. He is the latest Israeli public figure to be accused of sexual misconduct. Shalom is one of Israels best-known politicians and had previously served as foreign minister and finance minister.  In May, Ehud Olmert, a former prime minister who was forced from office over allegations of corruption, was sentenced to eight months in jail for fraud and breach of trust in a case involving an American businessman.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/middleeast/israel-silvan-shalom-resignation.html", 
                    "title": "Israeli Minister Accused of Sexual Misconduct to Resign", 
                    "date": "2015-12-20", 
                    "summary": "The official, Silvan Shalom, the Israeli interior minister and deputy prime minister, has denied the..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "In the decades since the civil war, there hasnt been any public reckoning of the ruptures that led to it. Before the first coup, during the civil war, and after, Igbos have felt the threat of economic, social and political marginalization. A civil war ensued. The new pro-Biafran protests are led by youth who have little memory of Biafra or the brutality and horror of the civil war. There are no national memorials, except for the poorly funded and run-down National War Museum in Umuahia, a city in the former Republic of Biafra.", 
                    "link": "http://www.nytimes.com/2015/12/21/opinion/facing-down-nigerias-ghosts.html", 
                    "title": "Facing Down Nigeria’s Ghosts", 
                    "date": "2015-12-20", 
                    "summary": "In the decades since the civil war, there hasnt been any public reckoning of the ruptures that led t..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "In October, a building collapsed in the central province of Henan, killing at least 17 construction workers. A section of a major pipeline that transports natural gas from Chinas west exploded as the landslide struck, Xinhua reported. The number of people reported missing climbed earlyMondayto 91, the official Xinhua News Agency reported. A landslide in May in southwestern Guizhou Province caused a nine-story building to collapse, killing 16 people. About 1,500 rescue workers were searching the rubble, according to a report on the official page of the Guangming New District government on Sina Weibo, Chinas Twitter-like social media site.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/asia/landslide-hits-southern-city-sending-hundreds-fleeing-china-reports.html", 
                    "title": "Landslide Hits Southern City, Sending Hundreds Fleeing, China Reports", 
                    "date": "2015-12-20", 
                    "summary": "In October, a building collapsed in the central province of Henan, killing at least 17 construction ..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "The commander, Samir Kuntar, was freed as part of an exchange that returned the bodies of two soldiers to Israel. RAMALLAH, West Bank  A Hezbollah commander whom Israel reluctantly released in 2008  nearly 30 years after he took part in a notorious terrorist attack  was killed in an airstrike in Syria, Hezbollah and his family said on Sunday. Hezbollah, a Shiite militia and political movement, blamed Israel for the assault, but Israeli officials had no comment. Al Manar praised him Sunday morning as the dean of Arab detainees.The devastating 2006 war between Israel and Hezbollah began, in a way, because of him. When asked if Israel had those capabilities, he responded: Israel is one of the leaders.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/middleeast/samir-kuntar-hezbollah-syria-israel.html", 
                    "title": "Commander of Hezbollah Freed by Israel Is Killed in Syria", 
                    "date": "2015-12-20", 
                    "summary": "The commander, Samir Kuntar, was freed as part of an exchange that returned the bodies of two soldie..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "Air France Flight 463 was headed from the island of Mauritius to Paris when a passenger noticed the suspicious device. The scare was the latest incident to affect Air France and other airlines in recent weeks amid heightened concerns of potential terrorist threats to air travel in the wake of the Oct. 31 crash of the Russian airliner. NAIROBI  An Air France jetliner flying over the Indian Ocean made an emergency landing in Kenya on Sunday after a suspicious device found in a bathroom turned out to be constructed of cardboard and made to look like a bomb. The passenger notified the crew, who alerted the captain, Kenyan officials said, and the plane then diverted from its flight path and made an emergency landing in the Kenyan coastal city of Mombasa shortly after midnight Sunday. Egyptian investigators, however, say they have so far uncovered no evidence proving the plane was brought down by a bomb.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/africa/air-france-emergency-landing-kenya-device.html", 
                    "title": "French Airliner Makes Emergency Landing in Kenya After ‘False Alarm’", 
                    "date": "2015-12-20", 
                    "summary": "Air France Flight 463 was headed from the island of Mauritius to Paris when a passenger noticed the ..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": " Garcia Godoy to discuss the violence of the past 24 hours. New York Herald Tribune, European Edition, December 21, 1965 Francisco Caamano Deno as automatic arms fire continued to crackle throughout the city after weekend fighting that claimed at least nine lives. Caamano Deno went to the presidential palace and met with Mr. SANTO DOMINGO  Gunmen today [Dec . 20] machine-gunned the residence of civil war rebel leader Col. But the new fighting was seen as a severe blow to the rule of provisional President Hector Garcia Godoy, who only last week announced that rebel troops would be reintegrated into the Dominican armed forces.", 
                    "link": "http://iht-retrospective.blogs.nytimes.com/2015/12/20/1965-fighting-continues-in-dominican-republic/", 
                    "title": "1965: Fighting Continues in Dominican Republic", 
                    "date": "2015-12-20", 
                    "summary": " Garcia Godoy to discuss the violence of the past 24 hours. New York Herald Tribune, European Editio..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "Official figures from July to Dec. 14 reveal that 12,091 bodies  2,998 adults and 9,093 children  have been found in Shanghais streets.  Since the severest cold here is just beginning, death figures will increase in the remaining winter months.New York Herald Tribune, European Edition, December 21, 1940 SHANGHAI  A homeless, elderly Chinese beggar who made his bed last night [Dec. 19] in an empty coffin in the French Concession was found dead this morning as a result of exposure. Of this number 398 adults and 691 children were found dead in the first two weeks of this month. High cost of living and general unemployment, largely caused by war conditions, are responsible for this tragic situation.", 
                    "link": "http://iht-retrospective.blogs.nytimes.com/2015/12/20/1940-extreme-cold-weather-in-shanghai-claims-hundreds-of-lives/", 
                    "title": "1940: Extreme Cold Weather in Shanghai Claims Hundreds of Lives", 
                    "date": "2015-12-20", 
                    "summary": "Official figures from July to Dec. 14 reveal that 12,091 bodies  2,998 adults and 9,093 children  ha..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "MADRID  The conservative governing party won the most votes on Sunday, but lost its majority in parliamentary elections that underlined the fragmentation of Spanish politics and left the countrys future leadership unclear. In October, a center-right coalition won the most votes in Portugals elections, but it was then ousted from office in a parliamentary vote after Mr. Podemos was formed early last year as a far-left, anti-austerity party, modeled in part on the success of Syriza, the governing party in Greece. Rajoys Popular Party won 123 of the 350 parliamentary seats, down from 186 seats in the last elections, in 2011, according to the results with nearly all of the votes counted. Before Sundays vote, the leaders of Spains main parties had hinted at possible coalition partnerships, without firmly committing to any.", 
                    "link": "http://www.nytimes.com/2015/12/21/world/europe/spain-election-rajoy-citizens-podemos.html", 
                    "title": "Governing Party Loses Majority in Spanish Parliamentary Vote", 
                    "date": "2015-12-20", 
                    "summary": "MADRID  The conservative governing party won the most votes on Sunday, but lost its majority in parl..."
                }, 
                {
                    "category": "world", 
                    "website": "NYT", 
                    "all": "Now, as it seeks to expand its audience globally, Axel Springer has moved aggressively to increase its portfolio. Peters, 50, is poised to become one of the next Axel Springer managers to more fully embrace the groups digital future. In addition to the financial investment, Axel Springers main real estate portal, Immonet, formed a joint marketing partnership with Airbnb in Germany. In the summer of 2012, he sent three of Axel Springers most senior managers to California for nine months. Nonetheless, Axel Springer, a family-controlled empire with deep ties to Germanys political establishment, has shown a willingness to place more opportunistic bets as well.", 
                    "link": "http://www.nytimes.com/2015/12/21/business/media/an-old-media-empireaxel-springer-reboots-for-the-digital-age.html", 
                    "title": "An Old-Media Empire, Axel Springer Reboots for the Digital Age", 
                    "date": "2015-12-20", 
                    "summary": "Now, as it seeks to expand its audience globally, Axel Springer has moved aggressively to increase i..."
                }
            ]
        }
    }
]