[
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "\"The countries here mentioned have decided on the formation of a military alliance led by Saudi Arabia to fight terrorism, with a joint operations center based in Riyadh to coordinate and support military operations,\" the statement said. A long list of Arab countries such as Egypt, Qatar, the United Arab Emirates, together with Islamic countries Turkey, Malaysia, Pakistan and Gulf Arab and African states were mentioned. Saudi Arabia and its Gulf Arab neighbors have been locked in nine months of warfare with Iran-allied rebels in neighboring Yemen, launching hundreds of air strikes there. Asked if the new alliance would focus just on Islamic State, bin Salman said it would confront not only that group but \"any terrorist organization that appears in front of us.\" Islamic State has pledged to overthrow the monarchies of the Gulf and have mounted a series of attacks on Shi'ite Muslim mosques and security forces in Kuwait and Saudi Arabia.", 
        "title": "Saudi Arabia announces 34-state Islamic military alliance against terrorism", 
        "summary": "\"The countries here mentioned have decided on the formation of a military alliance led by Saudi Arabia to fight terrorism, with a joint operations center based in Riyadh to coordinate and support military operations,\" the statement said. A long list ...", 
        "link": "http://www.reuters.com/article/us-saudi-security-idUSKBN0TX2PG20151215"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Most drugs are produced in border areas controlled by ethnic rebel armies or by the Myanmar military and allied militias. He called for the scaling up UNODC projects in Myanmar to provide opium farmers with alternative sources of income, such as coffee. That figure was steady from the previous year, as was the total area under opium poppy cultivation, which stood at 55,500 hectares (212 sq miles) in 2015, the UNODC said. Myanmar produced an estimated 647 tons of opium in 2015, second only to Afghanistan, the United Nations Office on Drugs and Crime (UNODC) said in a new report. Myanmar, Laos and Thailand make up the so-called Golden Triangle, which churns out a quarter of the world's opium.", 
        "title": "Myanmar's high opium output a huge test for Suu Kyi government: U.N.", 
        "summary": "Most drugs are produced in border areas controlled by ethnic rebel armies or by the Myanmar military and allied militias. He called for the scaling up UNODC projects in Myanmar to provide opium farmers with alternative sources of income, such as coff...", 
        "link": "http://www.reuters.com/article/us-myanmar-drugs-idUSKBN0TY0IO20151215"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "The 3,000-strong New People's Army, the armed wing of the communist party, operates mainly in the eastern and southern regions of the country. The Philippines has a separate truce with the Moro Islamic Liberation Front, the largest Muslim rebel group in the south of the mainly Catholic country. \"This ceasefire order is being issued in solidarity with the Filipino peoples traditional celebrations of Christmas and New Year holidays,\" said Jalandoni, a former Catholic priest based in the Netherlands. Last year, the two sides signed a peace deal to end four decades of fighting that has killed 120,000 people. The rebels were also demanding that the government free all political prisoners, including 17 guerrillas who are part of the peace negotiations.", 
        "title": "Philippine Maoist guerillas declare ceasefire for Christmas holidays", 
        "summary": "The 3,000-strong New People's Army, the armed wing of the communist party, operates mainly in the eastern and southern regions of the country. The Philippines has a separate truce with the Moro Islamic Liberation Front, the largest Muslim rebel group...", 
        "link": "http://www.reuters.com/article/us-philippines-rebels-idUSKBN0TY0HU20151215"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "CBI investigators were searching the office of Rajendra Kumar, principal secretary of the Delhi government, near Kejriwal's office, the CBI official said. \"It has become a fashion of the Delhi chief minister to quarrel with the central government and take the name of the prime minister for each and everything,\" Naidu said. Arvind Kejriwal, chief of Aam Aadmi (Common Man) Party (AAP), shouts slogans after taking the oath as the new chief minister of Delhi during a swearing-in ceremony at Ramlila ground in New Delhi February 14, 2015. That election victory in New Delhi smashed the aura of invincibility built around Modi in his first major electoral upset since being appointed prime minister. The Central Bureau of Investigations (CBI) was not raiding Kejriwal's office, said a senior CBI official, who declined to be identified as he was not authorized to speak to the media.", 
        "title": "Delhi chief minister says office raided, calls Modi a psychopath", 
        "summary": "CBI investigators were searching the office of Rajendra Kumar, principal secretary of the Delhi government, near Kejriwal's office, the CBI official said. \"It has become a fashion of the Delhi chief minister to quarrel with the central government and...", 
        "link": "http://www.reuters.com/article/us-india-politics-idUSKBN0TY0HA20151215"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Yau Yau has released 1,755 child soldiers from his ranks since he signed a peace deal with the government in 2014.  \"There also needs to be accountability for commanders who have recruited and used child soldiers to end this endless cycle.\" The United Nations says 16,000 children have joined armed groups since South Sudan's civil war erupted two years ago. South Sudan's army spokesman Philip Aguer said its Child Protection Unit had planned to visit Unity State in 2013 to investigate allegations of Puljang using child soldiers. Rebel child soldiers gather in Gumuruk, as they prepare to handover their weapons at a demobilisation ceremony in Jonglei State, eastern South Sudan, January 27, 2015.", 
        "title": "South Sudanese commanders use child soldiers as 'cannon fodder'", 
        "summary": "Yau Yau has released 1,755 child soldiers from his ranks since he signed a peace deal with the government in 2014.  \"There also needs to be accountability for commanders who have recruited and used child soldiers to end this endless cycle.\" The Unite...", 
        "link": "http://www.reuters.com/article/us-southsudan-children-idUSKBN0TY0FS20151215"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "The Sinaloa state attorney general, Marco Antonio Higuera, confirmed through a spokesman that all results showed the corpses were of the missing men, Dean Lucas and Adam Coleman. Sinaloa State Attorney General Marco Antonio Higuera talks to the media, about the detention of suspects involved in a case of missing Australian surfers, during a news conference at the state prosecutor's office in Culiacan, Sinaloa December 4, 2015. Sinaloa is notorious in Mexico as the heartland of some of the country's most powerful and dangerous drug cartels. A burnt van is seen on a dirt road in Juan Aldama, November 21, 2015. Sinaloa officials this month arrested three men over the disappearance, but said two suspects remain at large.", 
        "title": "Mexico confirms burnt remains are missing Australian surfers", 
        "summary": "The Sinaloa state attorney general, Marco Antonio Higuera, confirmed through a spokesman that all results showed the corpses were of the missing men, Dean Lucas and Adam Coleman. Sinaloa State Attorney General Marco Antonio Higuera talks to the media...", 
        "link": "http://www.reuters.com/article/us-mexico-australians-idUSKBN0TY0FF20151215"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Norway's Prime Minister Erna Solberg delivers a speech for the opening day of the World Climate Change Conference 2015 (COP21) at Le Bourget, near Paris, France, November 30, 2015. OSLO Norway's Prime Minister Erna Solberg will announce a reshuffle of her minority right-wing cabinet on Wednesday, the first such move since taking power in October 2013, tabloid newspaper VG reported, quoting sources close to the government. Solberg's Conservative Party rules in coalition with the anti-immigration Progress Party of Finance Minister Siv Jensen, who will remain in her current position, VG said on Tuesday.", 
        "title": "Norway PM to reshuffle government on Wednesday: newspaper VG", 
        "summary": "Norway's Prime Minister Erna Solberg delivers a speech for the opening day of the World Climate Change Conference 2015 (COP21) at Le Bourget, near Paris, France, November 30, 2015. OSLO Norway's Prime Minister Erna Solberg will announce a reshuffle o...", 
        "link": "http://www.reuters.com/article/us-norway-government-idUSKBN0TY0EV20151215"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "At that time, more than two dozen bankers came over to Standard Chartered from Harrison Lovegrove. Asia-focused lender Standard Chartered (2888.HK) expanded its energy M&A advisory team just before the global financial crisis by acquiring Harrison Lovegrove, a well regarded boutique advisory firm for oil and gas. But as the bank's overall performance dropped due to higher regulatory problems, its energy M&A business also suffered and Standard Chartered's ranking slipped to 44th this year. \"The model of pure advice doesn't fit with Standard Chartered's new scheme of things. In years following Harrison Lovegrove acquisition, Standard Chartered's Asia-Pacific M&A league table ranking improved to 13th in 2013 from 35th in 2008, according to Thomson Reuters data.", 
        "title": "Exclusive: StanChart axes senior bankers in energy M&A team - sources", 
        "summary": "At that time, more than two dozen bankers came over to Standard Chartered from Harrison Lovegrove. Asia-focused lender Standard Chartered (2888.HK) expanded its energy M&A advisory team just before the global financial crisis by acquiring Harrison Lo...", 
        "link": "http://www.reuters.com/article/us-stanchart-energy-banking-exclusive-idUSKBN0TY0DZ20151215"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "Volkswagen, Europe's biggest carmaker by sales, saw its core brand market share tumble to 12.2 percent from 13.5 percent, as sales edged just 3.1 percent higher, underperforming the market. The broader European auto recovery is set to continue into 2016 after an 8.6 percent expansion in January-November, Ernst & Young analyst Anil Valsan said. Cars are lined up for sale at a Ford dealer in Lakewood, Colorado in this September 4, 2013 file photo. Fiat Chrysler, Ford and Opel all saw November sales rise more than 18 percent, with GM's European arm helped by the recently launched Astra compact. Sales by France's Renault (RENA.PA) advanced 15.1 percent, while domestic rival PSA Peugeot Citroen (PEUP.PA) rose 12.8 percent, with a buoyant Peugeot brand tempered by a weaker Citroen performance.", 
        "title": "U.S. brands tap European auto recovery as Volkswagen left behind", 
        "summary": "Volkswagen, Europe's biggest carmaker by sales, saw its core brand market share tumble to 12.2 percent from 13.5 percent, as sales edged just 3.1 percent higher, underperforming the market. The broader European auto recovery is set to continue into 2...", 
        "link": "http://www.reuters.com/article/us-europe-carsales-idUSKBN0TY0JY20151215"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "Model Alison Fiori poses next to a 2012 Jeep Grand Cherokee Limited on the final press preview day for the North American International Auto Show in Detroit, Michigan, in this January 10, 2012 file photo.2015 Jeep Grand Cherokee are exhibited on a car dealership in New Jersey, July 24, 2015. MOSCOW Russian state standards agency Rosstandart said on Tuesday it had been informed about the recall of 6,635 Fiat Chrysler Automobiles' (FCAU.N) (FCHA.MI) Jeep Grand Cherokee cars over a pump relay issue. It said the recall would affect cars produced before May 2013 and sold from November 2010 through July 2013.", 
        "title": "Russia's agency says 6,635 Jeep Grand Cherokee cars recalled", 
        "summary": "Model Alison Fiori poses next to a 2012 Jeep Grand Cherokee Limited on the final press preview day for the North American International Auto Show in Detroit, Michigan, in this January 10, 2012 file photo.2015 Jeep Grand Cherokee are exhibited on a ca...", 
        "link": "http://www.reuters.com/article/us-russia-jeep-recall-idUSKBN0TY0IC20151215"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "Investors have mostly priced in a Fed rate hike this week, with the main question now turning to how many increases will follow next year. But Japan's Nikkei stock index ended down 1.7 percent at a 7-1/2-week low, extending losses as crude oil prices resumed their slide. An expected U.S. rate increase at this week's Fed's monetary policy meeting has also made investors wary. In Asian trade, the dollar edged down about 0.2 percent against a basket of currencies to 97.388. On Wall Street, major indexes erased early losses and returned to positive territory as oil prices found their legs.", 
        "title": "Asian stocks firm as Fed decision looms, yuan slips", 
        "summary": "Investors have mostly priced in a Fed rate hike this week, with the main question now turning to how many increases will follow next year. But Japan's Nikkei stock index ended down 1.7 percent at a 7-1/2-week low, extending losses as crude oil prices...", 
        "link": "http://www.reuters.com/article/us-global-markets-idUSKBN0TY01920151215"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "SEOUL The outlook for the global auto market is \"not bright\" next year, Hyundai Motor Group Chairman Chung Mong-koo said on Tuesday, indicating 2016 will be another challenging year for the world's fifth-largest automaker. \"Considering many leading indicators, the outlook for next year's auto market is also not bright,\" he said. Hyundai Motor Co (005380.KS), which combined with sister firm Kia Motors Corp (000270.KS) is the world's fifth-largest car-maker, posted its seventh-straight decline in quarterly profit in October. Speaking to the heads of the automaker's overseas units, Chung said growth this year was constrained by a weak global economy, the economic slowdown in the world's second-largest auto market China and a decline in emerging market demand. Workers walk between cars made by South Korea's biggest automakers Hyundai Motor Co and sister company Kia Motors at the company's shipping yard at a port in Pyeongtaek in this July 21, 2014 file photo.", 
        "title": "Hyundai Motor chairman says auto market 2016 outlook 'not bright'", 
        "summary": "SEOUL The outlook for the global auto market is \"not bright\" next year, Hyundai Motor Group Chairman Chung Mong-koo said on Tuesday, indicating 2016 will be another challenging year for the world's fifth-largest automaker. \"Considering many leading i...", 
        "link": "http://www.reuters.com/article/us-hyundai-motor-outlook-idUSKBN0TY0I020151215"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "Fed policymakers saw higher inflation around the corner in 2013 and 2014 that did not materialize. Federal Reserve Chairman Janet Yellen speaks at an event hosted by the Economic Club of Washington in Washington December 2, 2015. This shows Yellen \"is grounded in traditional modeling but she is well aware that there is uncertainty,\" said Randall Kroszner, who served with Yellen as a Fed governor between 2006 and 2009. Plosser would have preferred to raise rates \"a year ago\" but was glad that the Fed chief facilitated the debate over liftoff. On the other side of the policy debate is Charles Plosser, who led the Philadelphia Fed from 2006 until March 2015.", 
        "title": "Fed's Yellen: an orthodox economist for unorthodox times", 
        "summary": "Fed policymakers saw higher inflation around the corner in 2013 and 2014 that did not materialize. Federal Reserve Chairman Janet Yellen speaks at an event hosted by the Economic Club of Washington in Washington December 2, 2015. This shows Yellen \"i...", 
        "link": "http://www.reuters.com/article/us-usa-fed-yellen-insight-idUSKBN0TY0G920151215"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "Oil markets usually see strong demand towards year's end as the northern hemisphere enters its peak winter heating demand season. \"The weather is very mild with reduced demand for heating oil,\" said Oystein Berentsen, managing director of crude oil at Strong Petroleum (0852.HK). \"The oil market remains more tightly balanced than is reflected in today's low prices. Yet an unusually mild start to winter, in part due to the El Nino weather phenomenon, has limited heating demand. \"Land storage capacity is now limited but OPEC keeps increasing production so the oil price is relentlessly trending down.", 
        "title": "Oil extends losing streak as oversupply concerns persist", 
        "summary": "Oil markets usually see strong demand towards year's end as the northern hemisphere enters its peak winter heating demand season. \"The weather is very mild with reduced demand for heating oil,\" said Oystein Berentsen, managing director of crude oil a...", 
        "link": "http://www.reuters.com/article/us-global-oil-idUSKBN0TY0AJ20151215"
    }, 
    {
        "category": "politics", 
        "website": "Reuters", 
        "all": "Republican U.S. presidential candidate Donald Trump gives a thumbs-up during a speech at a Donald Trump for president rally in Las Vegas, Nevada December 14, 2015. Georgie Cicerone, 15, wears buttons on his suit supporting republican U.S. presidential candidate Donald Trump as he attends Trump's rally in Las Vegas, Nevada December 14, 2015. \"If you want to win, place or show in Iowa and New Hampshire, you have to attack Trump in the Vegas debate and show some chops,\" said Republican strategist Scott Reed. The latest Reuters/Ipsos poll, completed after Trump's comments, showed him leading the field with support of 35 percent of Republican voters. All this should give Trump the incentive to go on the offense at the debate, which will begin at 9 p.m.", 
        "title": "At Las Vegas debate, Republican Cruz may have a Trump problem", 
        "summary": "Republican U.S. presidential candidate Donald Trump gives a thumbs-up during a speech at a Donald Trump for president rally in Las Vegas, Nevada December 14, 2015. Georgie Cicerone, 15, wears buttons on his suit supporting republican U.S. presidentia...", 
        "link": "http://www.reuters.com/article/us-usa-election-idUSKBN0TY0GH20151215"
    }
]