[
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "With around 3,000 fighters, Islamic State has solidified its foothold in Libya by taking over the central city of Sirte. Output is less than half of the 1.6 million barrels per day the OPEC state had before 2011. Former colonial power Italy has sought to focus international attention on the OPEC country's drift toward anarchy, particularly since last month's deadly Islamic State attacks in Paris. Both Kerry and Gentiloni, who co-chaired the meeting, appeared confident a deal was around the corner, and stressed that a unity government was needed also to fight the growing threat from Islamic State militants. \"In my opinion, the U.N.-brokered political agreement will die just like the Rome conference will after today,\" GNC lawmaker Abdulqader Hawaili told Reuters.", 
        "title": "Powers back unity government in Libya to deter Islamic State", 
        "summary": "With around 3,000 fighters, Islamic State has solidified its foothold in Libya by taking over the central city of Sirte. Output is less than half of the 1.6 million barrels per day the OPEC state had before 2011. Former colonial power Italy has sough...", 
        "link": "http://www.reuters.com/article/us-libya-security-idUSKBN0TV0S920151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "French President Francois Hollande casts his ballot for the second-round in the regional elections in Tulle, France, December 13, 2015. Marine Le Pen (2ndL), French National Front political party leader and candidate for the National Front in the Nord-Pas-de-Calais-Picardie region, casts her ballot in the second-round regional elections in Henin-Beaumont, France, December 13, 2015. Marine Le Pen, French National Front political party leader and candidate for the National Front in the Nord-Pas-de-Calais-Picardie region, speaks to journalists as she leaves the polling station after casting her ballot in the second-round regional elections in... Nicolas Sarkozy (L), former French president and current head of the Les Republicains political party, casts his ballot in the second-round regional elections in Paris, France, December 13, 2015. Marion Marechal-Le Pen (R), French National Front political party member and candidate for National Front in the Provence-Alpes-Cote d'Azur (PACA) region, speaks to journalists outside the polling station in the second-round regional elections in Carpentras, France, December...", 
        "title": "French far-right fails to win any regions in upset for Le Pen", 
        "summary": "French President Francois Hollande casts his ballot for the second-round in the regional elections in Tulle, France, December 13, 2015. Marine Le Pen (2ndL), French National Front political party leader and candidate for the National Front in the Nor...", 
        "link": "http://www.reuters.com/article/us-france-politics-idUSKBN0TW00320151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "\"Critics would say having a finance minister serving only two days doesn't bode well for the reputation of South Africa,\" said Mohammed Nalla, head of research at Nedbank Capital. \"This is reckless by President Zuma, he is playing Russian roulette with the South African economy,\" opposition Democratic Alliance leader Mmusi Maimane said. Under the hashtag #ZumaMustFall, individuals on Twitter said they would march in key cities on Wednesday, a public holiday in South Africa and the same day when the Federal Reserve, the U.S. central bank, is expected to raise interest rates - a move set to put emerging markets like South Africa under strain. Gordhan held the post of finance minister from 2009 to 2014, when he was replaced with Nene and moved to the post of minister for cooperative governance and traditional affairs. Zuma's office also criticized as a \"malicious fabrication\" reports that Nene was removed because Myeni was not happy with instructions from the respected former finance minister.", 
        "title": "In U-turn, South Africa's Zuma restores Gordhan to finance ministry", 
        "summary": "\"Critics would say having a finance minister serving only two days doesn't bode well for the reputation of South Africa,\" said Mohammed Nalla, head of research at Nedbank Capital. \"This is reckless by President Zuma, he is playing Russian roulette wi...", 
        "link": "http://www.reuters.com/article/us-safrica-gordhan-idUSKBN0TW0T320151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "JOHANNESBURG South Africa's incoming finance minister Pravin Gordhan will be sworn in at 0800 GMT on Monday, he told Reuters on Sunday, after President Jacob Zuma restored him to the post he held until 2014. \"I'm not in the job yet. Not until I'm sworn in tomorrow morning at 10 a.m.\" local time, he told Reuters.  Gordhan said a news conference was scheduled for 1000 GMT on Monday after his swearing in.", 
        "title": "South Africa's Pravin Gordhan to be sworn in as finance minister on Monday", 
        "summary": "JOHANNESBURG South Africa's incoming finance minister Pravin Gordhan will be sworn in at 0800 GMT on Monday, he told Reuters on Sunday, after President Jacob Zuma restored him to the post he held until 2014. \"I'm not in the job yet. Not until I'm swo...", 
        "link": "http://www.reuters.com/article/us-safrica-gordhan-confirmation-idUSKBN0TW0TL20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "A Cuban migrant looks at a mobile phone as the sun sets in the town of La Cruz, Costa Rica, November 27, 2015. The issue reached crisis proportions when Costa Rica broke up a gang of human smugglers, leaving the Cubans in the lurch. Costa Rica re-established relations with Cuba in 2009, the last country in Latin America to do so. Costa Rica closed its border after arresting the smugglers, then granted the Cubans temporary visas to pass through. But Nicaragua, a country further to the north, refused to follow suit, leaving Costa Rica with an ever growing number of migrants.", 
        "title": "Migrant crisis hangs over Costa Rican president's visit to Cuba", 
        "summary": "A Cuban migrant looks at a mobile phone as the sun sets in the town of La Cruz, Costa Rica, November 27, 2015. The issue reached crisis proportions when Costa Rica broke up a gang of human smugglers, leaving the Cubans in the lurch. Costa Rica re-est...", 
        "link": "http://www.reuters.com/article/us-cuba-costa-rica-idUSKBN0TW0UZ20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Demonstrators attend a protest calling for the impeachment of Brazil's President Dilma Rousseff near the National Congress in Brasilia, Brazil, December 13, 2015. Demonstrators burn a Worker Party flag during a protest calling for the impeachment of Brazil's President Dilma Rousseff in front of the National Congress in Brasilia, Brazil, December 13, 2015. Demonstrators burn a coffin that represents Brazil's President Dilma Rousseff during a protest calling for the impeachment of Rousseff in front of the National Congress in Brasilia, Brazil, December 13, 2015. Demonstrators burn a coffin that represent Brazil's President Dilma Rousseff during a protest calling for the impeachment of Rousseff in front of the National Congress in Brasilia, Brazil, December 13, 2015. A large-scale mobilization could increase pressure on lawmakers to vote for Rousseff's impeachment.", 
        "title": "Brazilians take to streets to demand Rousseff's impeachment", 
        "summary": "Demonstrators attend a protest calling for the impeachment of Brazil's President Dilma Rousseff near the National Congress in Brasilia, Brazil, December 13, 2015. Demonstrators burn a Worker Party flag during a protest calling for the impeachment of ...", 
        "link": "http://www.reuters.com/article/us-brazil-rousseff-protests-idUSKBN0TW0L420151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Thousands were killed in the ensuing inter-religious violence and roughly one-in-five Central Africans have been displaced in a de facto partition. A U.N. official said two peacekeepers were wounded in the fighting in Bangui and another was injured in the central town of Bria. Despite the deployment of the 11,000-strong MINUSCA last year and the presence of French soldiers, sporadic violence continues. \"CAR (Central African Republic) isn't ready to organize inclusive, democratic, credible, safe and transparent elections,\" it said, calling for a new transitional government and the cancellation of both the referendum and the elections. \"The vast majority of Central Africans are sick and tired of the conflict.", 
        "title": "Central African Republic voters brave violence in crucial referendum", 
        "summary": "Thousands were killed in the ensuing inter-religious violence and roughly one-in-five Central Africans have been displaced in a de facto partition. A U.N. official said two peacekeepers were wounded in the fighting in Bangui and another was injured i...", 
        "link": "http://www.reuters.com/article/us-centralafrica-referendum-idUSKBN0TW07Z20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "The Syrian army has said its strikes target insurgents that have launched attacks on government-held areas. The strikes killed at least two children and a school principal, it said. Syrian Civil Defence, a humanitarian rescue group that operates in rebel-held areas, put the death toll at 35 and said many others were wounded. The Syrian Observatory for Human Rights said unidentified war planes hit the town of Douma, 10 miles (15 km) northeast of the capital, and surface-to-surface missiles fired by the Syrian army also hit the surrounding areas, including Eastern Ghouta. Issam al-Rayyes, spokesman for the Southern Front of the insurgent Free Syrian Army, said as many as 60 people had been killed in strikes on the Douma area which started early on Sunday.", 
        "title": "Dozens die in strikes on Syrian school district, other areas", 
        "summary": "The Syrian army has said its strikes target insurgents that have launched attacks on government-held areas. The strikes killed at least two children and a school principal, it said. Syrian Civil Defence, a humanitarian rescue group that operates in r...", 
        "link": "http://www.reuters.com/article/us-mideast-crisis-syria-school-idUSKBN0TW0HC20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "PARIS French Prime Minister Manuel Valls said the far-right National Front failed to win any region in local elections on Sunday but added that the anti-immigrant party's high score should force the government to listen. \"Tonight, there is no place for relief or triumphalism,\" Valls said. \"The danger posed by the far-right has not gone away, far from it.\" He was speaking after exit polls showed the far-right National Front had lost election run-offs in at least three key regions, despite topping last week's first round.", 
        "title": "French PM Valls says FN wins no region, but danger still there", 
        "summary": "PARIS French Prime Minister Manuel Valls said the far-right National Front failed to win any region in local elections on Sunday but added that the anti-immigrant party's high score should force the government to listen. \"Tonight, there is no place f...", 
        "link": "http://www.reuters.com/article/us-france-politics-valls-idUSKBN0TW0RX20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Le Pen said the result would not discourage the \"inexorable rise, election after election, of a national movement\" behind her party. Le Pen, who lost to conservative candidate Xavier Bertrand in northern France despite largely leading in the first round, lashed out against \"defamation decided in gilded palaces.\" Marine Le Pen, French National Front (FN) political party leader and candidate for the National Front in the Nord-Pas-de-Calais-Picardie region, delivers a speech after results in the second-round regional elections in Henin-Beaumont, France, December 13, 2015. PARIS The far-right's rise in France is unstoppable, National Front leader Marine Le Pen told supporters after exit polls showed her party won no region in election run-offs, suffering a major disappointment after topping the votes in the first round. She hailed the \"total eradication\" of the Socialist Party representation in the southeast and the northern regions that the tactical vote produced.", 
        "title": "France's Le Pen says far-right rise unstoppable despite defeat", 
        "summary": "Le Pen said the result would not discourage the \"inexorable rise, election after election, of a national movement\" behind her party. Le Pen, who lost to conservative candidate Xavier Bertrand in northern France despite largely leading in the first ro...", 
        "link": "http://www.reuters.com/article/us-france-politics-le-pen-idUSKBN0TW0SS20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Nicolas Sarkozy, former French president and current head of the Les Republicains political party, leaves after speaking following the results for the second-round regional elections at his party's headquarters in Paris, France, December 13, 2015. PARIS The far-right National Front's high score in regional elections should be a warning to all mainstream politicians, former French President Nicolas Sarkozy said on Sunday after exit polls showed the FN had failed to win any regions. \"This mobilization in favor of our candidates should in no way let us forget the warning sent to all politicians, ourselves included, in the first round,\" he said. \"We now have to take the time for in-depth debates about what worries the French, who expect strong and precise answers,\" he said, citing Europe, unemployment, security and identity issues. He was speaking after exit polls showed the far-right National Front had lost election run-offs in at least three key regions, despite topping last week's first round.", 
        "title": "France's Sarkozy says strong FN vote a 'warning' to all politicians", 
        "summary": "Nicolas Sarkozy, former French president and current head of the Les Republicains political party, leaves after speaking following the results for the second-round regional elections at his party's headquarters in Paris, France, December 13, 2015. PA...", 
        "link": "http://www.reuters.com/article/us-france-politics-sarkozy-idUSKBN0TW0SZ20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Der Spiegel said the letter did not make specific demands and was similar to requests sent to other U.S. partners. German Chancellor Angela Merkel attends the weekly cabinet meeting at the Chancellery in Berlin, Germany, December 1, 2015.  Von der Leyen also wants to send 650 troops to Mali to help the French campaign against Islamist militants there. Defense Minister Ursula von der Leyen said last week Germany might need bigger armed forces to cope with the more assertive role. More than 3,000 personnel are currently deployed overseas and the Syria mission will raise that by up to 1,200.", 
        "title": "Merkel dismisses U.S. request for more military help against Islamic State", 
        "summary": "Der Spiegel said the letter did not make specific demands and was similar to requests sent to other U.S. partners. German Chancellor Angela Merkel attends the weekly cabinet meeting at the Chancellery in Berlin, Germany, December 1, 2015.  Von der Le...", 
        "link": "http://www.reuters.com/article/us-mideast-crisis-germany-idUSKBN0TW0T720151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "The power-sharing plan could revive government institutions paralyzed by political rivalries that have been heightened by the war in neighboring Syria. The proposal, widely discussed by politicians in Lebanon but not formally outlined in detail, would make Franjieh president and Hariri, a Sunni Muslim, prime minister. But local rivalries could prove a problem for a plan which requires winning over other Maronite politicians who are seeking the presidency, such as Michel Aoun, an ally of the Iran-backed Shi'ite movement Hezbollah, and Samir Geagea. Under Lebanon's political system, the presidency is reserved for a Maronite Christian. In a phone call, Hariri and Franjieh agreed to \"proceed on the joint path for the election of the president,\" a statement from Hariri's office said.", 
        "title": "Lebanon's Hariri says to pursue power-sharing plan for presidency", 
        "summary": "The power-sharing plan could revive government institutions paralyzed by political rivalries that have been heightened by the war in neighboring Syria. The proposal, widely discussed by politicians in Lebanon but not formally outlined in detail, woul...", 
        "link": "http://www.reuters.com/article/us-lebanon-politics-idUSKBN0TW0SL20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Merkel has resisted pressure from allies within her Christian Democratic Union (CDU) to put a cap on the number of refugees entering Germany, which is expected to top 1 million this year. Germany's Christian Democratic Union (CDU) deputy head Julia Kloeckner, secretary general Peter Tauber and party leader Chancellor Angela Merkel (L-R) speak during their meeting in Karlsruhe, December 13, 2015. CDU will hold a two-day congress in Karlsruhe on Monday. The chancellor added there was broad support in the CDU for her strategy to reduce the numbers. Germany's Christian Democratic Union (CDU) secretary general Peter Tauber stands on stage with Chancellor Angela Merkel as they tour the venue in Karlsruhe, December 13, 2015, where CDU will hold a two-day congress on Monday.", 
        "title": "Merkel wants to 'drastically reduce' refugee arrivals in Germany", 
        "summary": "Merkel has resisted pressure from allies within her Christian Democratic Union (CDU) to put a cap on the number of refugees entering Germany, which is expected to top 1 million this year. Germany's Christian Democratic Union (CDU) deputy head Julia K...", 
        "link": "http://www.reuters.com/article/us-europe-migrants-germany-idUSKBN0TW0SB20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "The Ipsos poll of 1,846 people was carried out Dec. 5-11. The poll suggests the election is likely to go a second round, which Fujimori would then win. Approval ratings for current center-left president Ollanta Humala, who beat Keiko Fujimori in the 2011 election but cannot constitutionally run in 2016, remain low at around 16 percent, according to the Ipsos poll. Alberto Fujimori ran Peru between 1990 and 2000 and is currently in jail for human rights abuses and corruption. If no candidate obtains 50 percent in the first round, the election goes to a run-off in June.", 
        "title": "Keiko Fujimori clear favorite in Peru election poll", 
        "summary": "The Ipsos poll of 1,846 people was carried out Dec. 5-11. The poll suggests the election is likely to go a second round, which Fujimori would then win. Approval ratings for current center-left president Ollanta Humala, who beat Keiko Fujimori in the ...", 
        "link": "http://www.reuters.com/article/us-peru-election-idUSKBN0TW0RZ20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Demonstrators take part in a protest organised by a Jewish group against a planned statue of Balint Homan in Szekesfehervar, Hungary, December 13, 2015. A demonstrator takes part in a protest organised by a Jewish group against a planned statue of Balint Homan in Szekesfehervar, Hungary, December 13, 2015. The private Balint Homan Foundation in Szekesfehervar, west of Budapest, wants to honor a man who was an eminent historian and minister of religion and education before and during World War Two. On Sunday he attended a Hanukkah candle-lighting ceremony at the small square in Szekesfehervar where the statue could stand. Hungary's Jewish community has called on the right-wing government of Prime Minister Viktor Orban's Fidesz party to block the statue.", 
        "title": "U.S. 'shocked' at Hungarian plans to honor WW2 anti-Semite", 
        "summary": "Demonstrators take part in a protest organised by a Jewish group against a planned statue of Balint Homan in Szekesfehervar, Hungary, December 13, 2015. A demonstrator takes part in a protest organised by a Jewish group against a planned statue of Ba...", 
        "link": "http://www.reuters.com/article/us-hungary-jews-statue-idUSKBN0TW0RG20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "A sect statement on Sunday said that \"tens of other members\" had been killed and named seven people, including Turi. An army spokesman, Colonel Sani Usman, accused sect members of trying to assassinate Buratai on Saturday and said that soldiers were forced to shoot in defense when sect members refused to move out of the convoy's way and became violent. Zakzaky's followers are generally viewed as peaceful but a similar altercation between the sect and the army occurred last year during a procession. The spate of violence began on Saturday when sect members tried to block a convoy carrying army chief of staff Lieutenant Colonel Tukur Buratai to a swearing-in ceremony for army recruits in Zaria, witnesses said. In the course of the raids, Zakzaky's deputy Muhammad Turi, who is normally based in Nigeria's second city Kano, was killed as was the sect spokesman, Ibrahim Usman, at Zakzaky's house, group members said.", 
        "title": "Nigerian forces arrest Shi'ite sect leader, kill two aides in raids", 
        "summary": "A sect statement on Sunday said that \"tens of other members\" had been killed and named seven people, including Turi. An army spokesman, Colonel Sani Usman, accused sect members of trying to assassinate Buratai on Saturday and said that soldiers were ...", 
        "link": "http://www.reuters.com/article/us-nigeria-violence-shi-ites-idUSKBN0TW0NJ20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "A man inspects the damage at an oil refinery and a gas station that were targeted by what activists said were U.S.-led air strikes, in the town of Tel Abyad of Raqqa governorate, Syria, October 2, 2014. WASHINGTON The United States and its allies conducted 15 air strikes in Iraq and seven in Syria against Islamic State on Saturday, the coalition leading the operations said. Six strikes in Ramadi hit multiple Islamic State targets, the Combined Joint Task Force said on Sunday, as Iraqi forces attempt to retake the city from the militants. Other air strikes in Iraq hit near Mosul, Fallujah, Sinjar, Tal Afar, Sultan Abdallah, Rawah and Qayyarah, the coalition said in a statement. In Syria, the air strikes hit near five cities including the militant stronghold of Raqqa, the Combined Joint Task Force said in a statement.", 
        "title": "U.S., allies conduct 15 strikes in Iraq, seven in Syria: U.S. military", 
        "summary": "A man inspects the damage at an oil refinery and a gas station that were targeted by what activists said were U.S.-led air strikes, in the town of Tel Abyad of Raqqa governorate, Syria, October 2, 2014. WASHINGTON The United States and its allies con...", 
        "link": "http://www.reuters.com/article/us-mideast-crisis-airstrikes-idUSKBN0TW0QA20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Poland, a staunch opponent of mandatory refugee quotas, was quick to come out against the EU border force proposal. EU officials said on Friday that foreign border guards would, as now, be under local command whenever deployed. \"We think the current situation justifies a certain ambition,\" the Commission's chief spokesman said on Friday, expressing confidence about backing from member states. \"This idea will face opposition from most member states,\" an EU diplomat said. Existing powers that effectively can suspend a country from the Schengen agreements if it fails to protect the external EU border are mandatory enough, some diplomats argue.", 
        "title": "EU border force plan faces resistance from governments", 
        "summary": "Poland, a staunch opponent of mandatory refugee quotas, was quick to come out against the EU border force proposal. EU officials said on Friday that foreign border guards would, as now, be under local command whenever deployed. \"We think the current ...", 
        "link": "http://www.reuters.com/article/us-europe-migrants-borderguards-idUSKBN0TW0G820151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Six years earlier, countries had bitterly walked away from global climate talks in Copenhagen without a deal. Participants are seen in silhouette as they look at a screen showing a world map with climate anomalies during the World Climate Change Conference 2015 (COP21) at Le Bourget, near Paris, France, December 8, 2015. A woman walks past a map showing the elevation of the sea in the last 22 years during the World Climate Change Conference 2015 (COP21) at Le Bourget, near Paris, France, December 11, 2015. But then the French minister was back. So on Nov. 30, the sprawling conference hall near the Le Bourget airfield on the outskirts of Paris hosted world leaders, who were supposed to deliver three minutes of encouragement.", 
        "title": "How the world learned its lesson and got a climate deal", 
        "summary": "Six years earlier, countries had bitterly walked away from global climate talks in Copenhagen without a deal. Participants are seen in silhouette as they look at a screen showing a world map with climate anomalies during the World Climate Change Conf...", 
        "link": "http://www.reuters.com/article/us-climatechange-summit-ticktock-idUSKBN0TW0PR20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Burundian police officers collect a cache of weapons recovered from suspected fighters after clashes in the capital Bujumbura, Burundi December 12, 2015. Suspected fighters are paraded before the media by Burundian police near a recovered cache of weapons after clashes in the capital Bujumbura, Burundi December 12, 2015. Foreign Minister Didier Reynders said he would take up the issue with his European Union colleagues when they meet on Monday and urged the United Nations Security Council and the Peace and Security Council of the African Union to take action. A woman mourns after her son was killed during gunfire in the Nyakabiga neighbourhood of Burundi's capital Bujumbura, December 12, 2015. Residents gather outside their houses in the Nyakabiga neighbourhood of Burundi's capital Bujumbura, December 12, 2015.", 
        "title": "Death toll from day of clashes in Burundi capital rises to nearly 90", 
        "summary": "Burundian police officers collect a cache of weapons recovered from suspected fighters after clashes in the capital Bujumbura, Burundi December 12, 2015. Suspected fighters are paraded before the media by Burundian police near a recovered cache of we...", 
        "link": "http://www.reuters.com/article/us-burundi-unrest-idUSKBN0TV08D20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Iran's Supreme Leader Ayatollah Ali Khamenei departs after casting his ballot in the parliamentary election in Tehran March 2, 2012. The Supreme Leader is commander-in-chief of the armed forces and appoints the heads of the judiciary. Khamenei is only the second Supreme Leader of Iran, selected in 1989 when Ayatollah Khomeini died. The assembly of 82 elected clerics is charged with electing, supervising and even disqualifying the Supreme Leader. But with an election in February of the Assembly of Experts, the clerical body that appoints the Supreme Leader, such discussion is bound to come to the fore.", 
        "title": "Iran's possible next Supreme Leader being examined: Rafsanjani", 
        "summary": "Iran's Supreme Leader Ayatollah Ali Khamenei departs after casting his ballot in the parliamentary election in Tehran March 2, 2012. The Supreme Leader is commander-in-chief of the armed forces and appoints the heads of the judiciary. Khamenei is onl...", 
        "link": "http://www.reuters.com/article/us-iran-election-leader-idUSKBN0TW0OV20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Orban said Hungary needed strong police and anti-terror squads to protect itself. \"We will protect our borders (and) Hungarian people from criminals, terrorists (and) illegal immigrants,\" he said. Earlier this month, Hungary filed a lawsuit challenging EU's mandatory relocation quota system for migrants, along with neighboring Slovakia. A recent poll by Median showed Fidesz had 51 percent support among decided voters, compared with 21 percent for the second strongest party, the far-right Jobbik. Orban has received much criticism from the EU for his hard stance on immigration.", 
        "title": "Hungary's Orban plans to lead party into 2018 election", 
        "summary": "Orban said Hungary needed strong police and anti-terror squads to protect itself. \"We will protect our borders (and) Hungarian people from criminals, terrorists (and) illegal immigrants,\" he said. Earlier this month, Hungary filed a lawsuit challengi...", 
        "link": "http://www.reuters.com/article/us-hungary-orban-idUSKBN0TW0LF20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "The European head of Facebook is under investigation in Germany over the social network's alleged failure to remove racist hate speech. The overnight attack on the social networking group was carried out by a group of 15-20 people wearing black clothes and hoods, police said in a statement. A 3D plastic representation of the Facebook logo is seen in this illustration in Zenica, Bosnia and Herzegovina, May 13, 2015. A Facebook spokesperson last month declined to comment on the investigation, adding \"we can say that the allegations lack merit and there has been no violation of German law by Facebook or its employees.\" Facebook has a partnership with a group called FSM, which monitors multimedia service providers on a voluntary basis, and has said it would encourage its users to push back against racism.", 
        "title": "Vandals attack Facebook building in Germany", 
        "summary": "The European head of Facebook is under investigation in Germany over the social network's alleged failure to remove racist hate speech. The overnight attack on the social networking group was carried out by a group of 15-20 people wearing black cloth...", 
        "link": "http://www.reuters.com/article/us-germany-facebook-idUSKBN0TW0LJ20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "This year, the Adana authorities changed the festival's name to the \"Adana Kebab and Turnip Festival,\" Dogan said. Now its sixth year, the event was previously called the \"World Raki Festival\" but organizers changed the name this year because of pressure from conservative anti-alcohol groups who had wanted it banned, Dogan said. Plainclothes police later arrested four suspects for allegedly hitting tables with the long knives used to carve up kebabs, Dogan said. Although Turkey is constitutionally secular, the overwhelming majority of the population is Muslim. The Hurriyet newspaper showed footage online of a group of men running through a crowded bazaar in the city of Adana, shouting and firing a gun into the air.", 
        "title": "Armed men storm raki festival in Turkey in anti-alcohol protest", 
        "summary": "This year, the Adana authorities changed the festival's name to the \"Adana Kebab and Turnip Festival,\" Dogan said. Now its sixth year, the event was previously called the \"World Raki Festival\" but organizers changed the name this year because of pres...", 
        "link": "http://www.reuters.com/article/us-turkey-alcohol-idUSKBN0TW0O120151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "\"The death toll has reached 24 and 70 are wounded,\" said Amjad Ali Khan, the political head of Kurram Agency. Earlier this week Reuters reported that a Shi'ite unit of Pakistani fighters known as the Zeinabiyoun were joining the war against Islamic State in Syria. A couple of small militant groups who splintered from the Pakistani Taliban pledged allegiance to Islamic State, but they have not had much impact. Sufyan said Parachinar residents should not travel to Iran or Syria to fight in the war there on behalf of the Shi'ites. But Sunday's bombing, if carried out by the LeJ, is proof that the group can still mount devastating attacks.", 
        "title": "Death toll in northwest Pakistan blast rises to 24", 
        "summary": "\"The death toll has reached 24 and 70 are wounded,\" said Amjad Ali Khan, the political head of Kurram Agency. Earlier this week Reuters reported that a Shi'ite unit of Pakistani fighters known as the Zeinabiyoun were joining the war against Islamic S...", 
        "link": "http://www.reuters.com/article/us-pakistan-blast-idUSKBN0TW0BW20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Montealegre said there was evidence that FARC fighters used forced abortions to avoid losing female fighters \"as an instrument of war\". Spanish police said that according to Colombian authorities, victims of \"The Nurse\" had been raped by FARC fighters and included at least 50 underage girls. In the past the FARC has denied forcing women and girls to undergo abortions and said contraception is provided to female fighters in their ranks. The man, known as \"The Nurse\" and described by Spanish police in a statement as an ex-fighter himself, was detained in Madrid. Most of the abortions were carried out between 1998 and 2000, the police added.", 
        "title": "Spain arrests man for performing forced abortions on Colombian rebels", 
        "summary": "Montealegre said there was evidence that FARC fighters used forced abortions to avoid losing female fighters \"as an instrument of war\". Spanish police said that according to Colombian authorities, victims of \"The Nurse\" had been raped by FARC fighter...", 
        "link": "http://www.reuters.com/article/us-spain-colombia-arrest-idUSKBN0TW0MY20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Russian destroyer Smetlivy leaves the harbour at the Crimean port of Sevastopol September 12, 2013. \"In particular, our deep concerns about more Turkish provocations towards the Russian destroyer Smetlivy were conveyed.\" Earlier this month, Turkey complained to Russia over an incident in which a Russian sailor was pictured brandishing a rocket launcher on the deck of a naval ship passing through Istanbul. The Russian Defence Ministry said one of its warships, the destroyer Smetlivy, had been forced to fire the warning shots on Sunday morning and that it had summoned the Turkish military attache over the incident. The incident is likely to heighten tensions between the two nations who are seriously at odds over Syria and the Turkish shooting down of a Russian military jet last month.", 
        "title": "Russia warns Turkey over Aegean warship incident", 
        "summary": "Russian destroyer Smetlivy leaves the harbour at the Crimean port of Sevastopol September 12, 2013. \"In particular, our deep concerns about more Turkish provocations towards the Russian destroyer Smetlivy were conveyed.\" Earlier this month, Turkey co...", 
        "link": "http://www.reuters.com/article/us-mideast-crisis-russia-turkey-idUSKBN0TW0EU20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Israel has been cracking down on suspected Islamic State sympathizers in its Arab communities and among Palestinians in the occupied West Bank. Walla News said one of the Islamic State recruits previously served in Israel's Givati infantry brigade, a unit that has often operated in Gaza. Israel says dozens of Muslim Arab citizens have illegally traveled to Islamic State's Syrian or Iraqi fiefdoms, raising concerns they might return radicalized and trained to carry out armed attacks at home. Israeli concerns were raised in October after two videos surfaced in which militants identifying themselves as Islamic State members and speaking Arabic-accented Hebrew threatened to attack the country. Arabs make up 20 percent of Israel's population and are generally exempted from military service while most Jewish citizens are drafted.", 
        "title": "Israel says Arab who served in its army joined Islamic State", 
        "summary": "Israel has been cracking down on suspected Islamic State sympathizers in its Arab communities and among Palestinians in the occupied West Bank. Walla News said one of the Islamic State recruits previously served in Israel's Givati infantry brigade, a...", 
        "link": "http://www.reuters.com/article/us-mideast-crisis-islamicstate-israel-idUSKBN0TW0LW20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Supporters of Law and Justice party walk with a picture of Polish Prime Minister Beata Szydlo during pro-government demonstration in Warsaw, Poland December 13, 2015. Supporters of Law and Justice party walk with a portrait of late Pope John Paul II during a pro-government demonstration in Warsaw, Poland December 13, 2015. Waving Polish flags and PiS party banners, the demonstrators chanted the names of PiS leader Jaroslaw Kaczynski and PiS-backed President Andrzej Duda, who also took office this year. \"We won the election, but we have no right to set laws and remodel Poland,\" Kaczynski told the crowds before they marched towards the constitutional court building. The long-planned rally took place on the anniversary of the imposition of the 1981 martial law, the communist crackdown on the pro-democracy Solidarity trade union.", 
        "title": "Thousands rally to support Polish government after opposition protest", 
        "summary": "Supporters of Law and Justice party walk with a picture of Polish Prime Minister Beata Szydlo during pro-government demonstration in Warsaw, Poland December 13, 2015. Supporters of Law and Justice party walk with a portrait of late Pope John Paul II ...", 
        "link": "http://www.reuters.com/article/us-poland-protests-idUSKBN0TW0LP20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Two women won seats in al-Ahsa in Eastern Province, but their names were not immediately released. In Qassim, traditionally the most conservative part of the country, two women were elected but their names were not immediately released. Women rest after casting their votes at a polling station during municipal elections, in Riyadh, Saudi Arabia December 12, 2015. Some results had been announced on the official Saudi Press Agency, including the victories of four women. Before Abdullah announced women would take part in this year's elections, the country's Grand Mufti, its most senior religious figure, described women's involvement in politics as \"opening the door to evil\".", 
        "title": "First women elected to Saudi local councils", 
        "summary": "Two women won seats in al-Ahsa in Eastern Province, but their names were not immediately released. In Qassim, traditionally the most conservative part of the country, two women were elected but their names were not immediately released. Women rest af...", 
        "link": "http://www.reuters.com/article/us-saudi-election-idUSKBN0TW08E20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "In Beijing, foreign minister spokesman Hong Lei said the Paris agreement was a \"new starting point for international cooperation on climate change\". But this doesn't affect the fact that history has taken a huge step forward, and so we are satisfied. On Saturday, the global climate summit in Paris produced a landmark accord that set the course for an historic transformation of the world's fossil fuel-driven economy within decades in a bid to arrest global warming. Xie Zhenhua, Beijing's senior climate change envoy, said he welcomed what he described as a flawed agreement, echoing a similar summation from U.S. President Barack Obama. \"On post-2020 funding, they have written in the principle that developed countries have to provide support to developing countries but there are a lot of specifics that were impossible to put in the agreement.\"", 
        "title": "For China, climate deal is imperfect but huge step forward", 
        "summary": "In Beijing, foreign minister spokesman Hong Lei said the Paris agreement was a \"new starting point for international cooperation on climate change\". But this doesn't affect the fact that history has taken a huge step forward, and so we are satisfied....", 
        "link": "http://www.reuters.com/article/us-climatechange-summit-china-idUSKBN0TW0B320151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Ban has hosted three summits of his own on climate change since 2007, and joined a march of what he said was 400,000 people in New York last year. Still, he said \"I never was deterred\" even though many other world leaders gave up on climate change to focus on other issues such as fixing the financial crisis. Bush told her, \"'I would appreciate if you do it as the Secretary-General of the United Nations wants',\" Ban said. For almost a decade, Ban, 71, has traveled the world from the glaciers of Antarctica to corporate boardrooms in New York in search of photo opportunities and allies to secure an elusive global deal to curb global warming. The U.N. leader grew up in a home in South Korea with no electricity and reading by a kerosene lamp.", 
        "title": "For U.N.'s Ban, climate deal is personal victory after setbacks", 
        "summary": "Ban has hosted three summits of his own on climate change since 2007, and joined a march of what he said was 400,000 people in New York last year. Still, he said \"I never was deterred\" even though many other world leaders gave up on climate change to...", 
        "link": "http://www.reuters.com/article/us-climatechange-summit-bankimoon-idUSKBN0TW0JW20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "WikiLeaks founder Julian Assange speaks to the media outside the Ecuador embassy in west London on August 19, 2012. Assange, 44, took refuge in the embassy building in June 2012 to avoid extradition to Sweden, where he is wanted for questioning over allegations of sexual assault and rape against two women in 2010. Britain, which has accused Ecuador of preventing the course of justice by allowing Assange to remain in its embassy in the upmarket central London area of Knightsbridge, welcomed the agreement. Assange,\" the foreign ministry said in a weekend statement. QUITO Ecuador and Sweden have signed a pact that would allow WikiLeaks founder Julian Assange to be questioned by Swedish authorities at Ecuador's embassy in London where he has been holed up for more than three years since facing sexual assault charges, the Quito government said.", 
        "title": "Ecuador signs deal with Sweden for Assange questioning", 
        "summary": "WikiLeaks founder Julian Assange speaks to the media outside the Ecuador embassy in west London on August 19, 2012. Assange, 44, took refuge in the embassy building in June 2012 to avoid extradition to Sweden, where he is wanted for questioning over ...", 
        "link": "http://www.reuters.com/article/us-ecuador-sweden-assange-idUSKBN0TW0FX20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Mazen Mohamed Abdallah's family told the rights group the teenager was repeatedly tortured in custody, including also being given electric shocks to his genitals. The group said Abdallah was tortured into confessing membership of the Muslim Brotherhood and participating in an unauthorized protest. On Friday, nine police were referred to a criminal court and charged with beating to death a father of four. The boy's case is one of several highlighted over the past weeks by rights groups who say police brutality is once again widespread in Egypt. The group was then outlawed and security forces killed hundreds of its supporters and jailed thousands, with hundreds more sentenced to death in mass trials.", 
        "title": "Amnesty urges Egypt to free boy family says was abused by police", 
        "summary": "Mazen Mohamed Abdallah's family told the rights group the teenager was repeatedly tortured in custody, including also being given electric shocks to his genitals. The group said Abdallah was tortured into confessing membership of the Muslim Brotherho...", 
        "link": "http://www.reuters.com/article/us-egypt-rights-idUSKBN0TW0JB20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Former Scottish first minister Alex Salmond, the Scottish National Party's foreign affairs spokesman, said Blair and Jack Straw, who served as his interior minister and then foreign minister, had questions to answer. He was released in October after 13 years detention at Guantanamo and has returned to Britain. Aamer said a British officer, who he believed arrived at the base on a plane with then Prime Minister Tony Blair, was present in the room during the interrogation and did not intervene. A spokeswoman for the British government said on Sunday it did not participate in or condone torture and was determined to combat it \"wherever and whenever it occurs\". \"This American guy grabs me by the head, and he slams it backwards against the wall.", 
        "title": "British resident held in Guantanamo Bay says UK officers witnessed torture", 
        "summary": "Former Scottish first minister Alex Salmond, the Scottish National Party's foreign affairs spokesman, said Blair and Jack Straw, who served as his interior minister and then foreign minister, had questions to answer. He was released in October after ...", 
        "link": "http://www.reuters.com/article/us-britain-usa-guantanamo-idUSKBN0TW0J920151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Thelesklaf suggested countries consider following the examples of France and Italy and limit the use of cash, which unlike bank transfers leaves no electronic trail. Financial data play an important role here,\" he said. While financial data analysts often work with local police, they rarely have collaborated with intelligence agencies, and that needs to change, the lawyer said. The director of Liechtenstein's financial intelligence unit acknowledged how sensitive the matter was, but added: \"We cannot give a terrorist endless avenues to object. \"After an attack like the one in Paris you have to be able to match data at times from many countries within 24 hours about people, rental cars, purchased weapons.", 
        "title": "Getting, sharing data quickly key to fighting terror finance: expert", 
        "summary": "Thelesklaf suggested countries consider following the examples of France and Italy and limit the use of cash, which unlike bank transfers leaves no electronic trail. Financial data play an important role here,\" he said. While financial data analysts ...", 
        "link": "http://www.reuters.com/article/us-security-finance-idUSKBN0TW0H820151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": " In 2014, nearly 111,000 nationals from the EU plus Iceland, Norway and Liechtenstein immigrated to Switzerland, according to government figures. Migrants are pictured at the Zentrum Juch camp for asylum seekers, during a media visit in Zurich November 5, 2015. Around 1.3 million EU citizens already live in Switzerland and 300,000 cross the border daily to work. After months of tough negotiations, Berne and Brussels are still at loggerheads over how to implement an SVP-led 2014 Swiss referendum for immigration quotas that would violate a bilateral pact guaranteeing freedom of movement for EU workers. The SVP is the biggest party in the Swiss parliament.", 
        "title": "Swiss employers want flexibility on immigrant numbers: paper", 
        "summary": " In 2014, nearly 111,000 nationals from the EU plus Iceland, Norway and Liechtenstein immigrated to Switzerland, according to government figures. Migrants are pictured at the Zentrum Juch camp for asylum seekers, during a media visit in Zurich Novemb...", 
        "link": "http://www.reuters.com/article/us-swiss-europe-idUSKBN0TW0FE20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Lax fire safety standards and staff negligence have often been blamed for such episodes. The police said they had begun an investigation into possible negligence and experts from Moscow would be brought in to help out. Another 23 people were taken to various medical facilities in the area, police said. Seventy patients, some of them bed-bound or disabled, and four staff were in part of the building hit by the blaze.  In 2013, a fire killed 37 people in a psychiatric hospital in a provincial village north of Moscow, the second deadly blaze at such a facility that year alone.", 
        "title": "Fire at Russian mental health clinic in Voronezh region kills 23", 
        "summary": "Lax fire safety standards and staff negligence have often been blamed for such episodes. The police said they had begun an investigation into possible negligence and experts from Moscow would be brought in to help out. Another 23 people were taken to...", 
        "link": "http://www.reuters.com/article/us-russia-fire-idUSKBN0TW0AO20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "\"Afghan police and army have a presence in Marjah district center and the rest is controlled by Taliban,\" Sarjang said. Operations were also being hampered by supply interruptions and the chronic problem of desertions among the badly squeezed security forces.  Around 10 percent of the 10,000-strong police and army forces are absent from duty. Helmand police chief Abdul Rahman Sarjang said on Sunday security forces were holding on in the governor's compound and police and army headquarters but that surrounding areas were all in the hands of the insurgents. Helmand, an arid, semi-desert region and major center of opium cultivation, has long been one of the Taliban's heartlands and they have put increasing pressure on security forces since the withdrawal of international troops from combat last year.", 
        "title": "Afghan forces battle to hold off Taliban in Helmand district", 
        "summary": "\"Afghan police and army have a presence in Marjah district center and the rest is controlled by Taliban,\" Sarjang said. Operations were also being hampered by supply interruptions and the chronic problem of desertions among the badly squeezed securit...", 
        "link": "http://www.reuters.com/article/us-afghanistan-taliban-idUSKBN0TW0C220151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "\"Our head is above water,\" said Olai Uludong, ambassador on climate change for the Pacific island state of Palau. Scientists warned that the envisaged national emissions cuts will not be enough to keep warming to less than 2 degrees Celsius. The first \"stocktake\" would occur in 2023, with further reviews every five years to steadily increase or \"ratchet up\" those measures. Six years after the previous climate summit in Copenhagen ended in failure and acrimony, the Paris pact appears to have rebuilt much of the trust required for a concerted global effort to combat climate change, delegates said. \"Today we celebrate, tomorrow we have to work,\" European Climate Commissioner Miguel Arias Canete said.", 
        "title": "With landmark climate accord, world marks turn from fossil fuels", 
        "summary": "\"Our head is above water,\" said Olai Uludong, ambassador on climate change for the Pacific island state of Palau. Scientists warned that the envisaged national emissions cuts will not be enough to keep warming to less than 2 degrees Celsius. The firs...", 
        "link": "http://www.reuters.com/article/us-climatechange-summit-idUSKBN0TV04L20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Obama has made combating global climate change a top priority of his presidency but has encountered stiff resistance to his proposals from Republicans in Congress. Over the past seven years, we've transformed the United States into the global leader in fighting climate change,\" Obama said. \"Too many people have spent their careers pretending that climate change is a hoax perpetrated by shadowy environmental groups and Machiavellian research scientists,\" Grijalva said. Unlike the Kyoto pact, forged with Democratic President Bill Clinton in office, the Paris agreement will not be a fully legally binding treaty, which would almost certainly fail to pass in the U.S. Congress. \"We cannot afford to be slowed by the climate skeptics or deterred by the defeatists who doubt America's ability to meet this challenge,\" Clinton said, vowing to make climate change a top priority if elected president.", 
        "title": "Obama calls Paris climate pact 'best chance' to save the planet", 
        "summary": "Obama has made combating global climate change a top priority of his presidency but has encountered stiff resistance to his proposals from Republicans in Congress. Over the past seven years, we've transformed the United States into the global leader ...", 
        "link": "http://www.reuters.com/article/us-climatechange-summit-usa-obama-idUSKBN0TV0SQ20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "The DSB party said it could quit the Reformist Bloc if its other members decided to stay in the coalition. The changes were such that they prompted the resignation of the justice minister. Bulgaria's Prime Minister Boiko Borisov looks on after a session of the parliament in Sofia November 7, 2014. The Reformist Bloc would meet on Tuesday to decide if it also would withdraw its support of the government, party officials said. Another two parties from the Reformist Bloc have signaled they are likely to keep their support for the government, which could help avert an immediate political crisis.", 
        "title": "Cracks appear in Bulgaria's ruling coalition over judicial reforms", 
        "summary": "The DSB party said it could quit the Reformist Bloc if its other members decided to stay in the coalition. The changes were such that they prompted the resignation of the justice minister. Bulgaria's Prime Minister Boiko Borisov looks on after a sess...", 
        "link": "http://www.reuters.com/article/us-bulgaria-politics-idUSKBN0TW09820151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Residents in the southern district of Qabatiya said 7 civilians were killed in an attack on a market. Villagers in al-Hajawara in northern Hajjah province said multiple air bombings killed 12 people inside their homes and wounded 30 others. Half of the nearly 6,000 people killed in the fighting and air strikes are civilians, including 637 children, according to the United Nations. A seven-day ceasefire is due to start on Monday, the day before planned U.N.-sponsored peace talks in Switzerland, senior officials on both sides of the civil war said. Yemen's Iran-allied Houthi group is fighting a civil war against loyalists of President Abd-Rabbu Mansour Hadi, whose embattled government has been backed by air strikes and ground forces from a mainly Gulf Arab coalition led by Saudi Arabia.", 
        "title": "Saudi-led air strikes kill 19 Yemeni civilians: residents", 
        "summary": "Residents in the southern district of Qabatiya said 7 civilians were killed in an attack on a market. Villagers in al-Hajawara in northern Hajjah province said multiple air bombings killed 12 people inside their homes and wounded 30 others. Half of t...", 
        "link": "http://www.reuters.com/article/us-yemen-security-idUSKBN0TW08Y20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Ciudadanos party leader Albert Rivera, one of the four leading candidates for Spain's national election, delivers his speech during an election campaign rally in Valencia, Spain, December 12, 2015. Podemos (We Can) party leader Pablo Iglesias, one of the leading candidates for Spain's national election, delivers a speech during a campaign rally in Badalona, north eastern Spain, December 12, 2015. The governing center-right People's Party (PP) is widely expected to win the election, though with far less backing than it garnered four years ago as the vote becomes a four-way race. Podemos should also garner strong support in Madrid, according to that poll, leaving the Socialists trailing in fourth place there. One in three people either refused to give their preference, were undecided or planned to abstain, an official poll showed recently.", 
        "title": "Spain's new parties gain ground ahead of election", 
        "summary": "Ciudadanos party leader Albert Rivera, one of the four leading candidates for Spain's national election, delivers his speech during an election campaign rally in Valencia, Spain, December 12, 2015. Podemos (We Can) party leader Pablo Iglesias, one of...", 
        "link": "http://www.reuters.com/article/us-spain-election-polls-idUSKBN0TW08Q20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "With a few exceptions Russian firms do not produce the powerful gas turbines often installed in Russian power stations. The energy bridge is not just an underwater cable, you see,\" said Sergei Pikin, director of Russian consultancy Energy Development Fund. Russia has flown in emergency generators that cover some of Crimea's power needs, and Ukraine has partially restored power. A customer visits a grocery lit with candles due to a power cut, in Simferopol, Crimea, in this November 22, 2015 file photo. But until Crimea is fully hooked up to the Russian grid, it will be vulnerable to power disruptions.", 
        "title": "Russia-annexed Crimea faces long road to power security", 
        "summary": "With a few exceptions Russian firms do not produce the powerful gas turbines often installed in Russian power stations. The energy bridge is not just an underwater cable, you see,\" said Sergei Pikin, director of Russian consultancy Energy Development...", 
        "link": "http://www.reuters.com/article/us-ukraine-crisis-crimea-power-insight-idUSKBN0TW06G20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "A victim of a suicide bomb attack at Imam al-Sadeq Mosque arrives at the Amiri hospital in Al Sharq, Kuwait City, June 26, 2015. The status of the five other defendants sentenced to death in September was not clear. Islamic State claimed responsibility for the June 26 bombing, when a Saudi suicide bomber blew himself inside the Imam al-Sadeq mosque in Kuwait City, killing 27 people. A criminal court in September had sentenced seven defendants to death in the case. Kuwait cracked down on Islamist militants after the bombing, the country's worst militant attack.", 
        "title": "Kuwait court upholds one death sentence in mosque bombing", 
        "summary": "A victim of a suicide bomb attack at Imam al-Sadeq Mosque arrives at the Amiri hospital in Al Sharq, Kuwait City, June 26, 2015. The status of the five other defendants sentenced to death in September was not clear. Islamic State claimed responsibili...", 
        "link": "http://www.reuters.com/article/us-kuwait-sentences-idUSKBN0TW05T20151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Speaking in front of hundreds of soldiers, veterans and school children at the Nanjing Massacre memorial, Li said China would never let anybody deny the crimes of invaders. Soldiers placed large wreaths in front of the main memorial as funereal music played, in images carried live on state television. \"At the same time, we just resolutely oppose anyone who tries to beautify the war of aggression or tries to drive back on history,\" Li said. China consistently reminds its people of the 1937 massacre in which it says Japanese troops killed 300,000 people in its then capital. But the neighbors have been moving to improve ties long overshadowed by their painful history, and last month China, Japan and South Korea held their first three-way summit in three years.", 
        "title": "Xi absent as China marks low key Nanjing Massacre anniversary", 
        "summary": "Speaking in front of hundreds of soldiers, veterans and school children at the Nanjing Massacre memorial, Li said China would never let anybody deny the crimes of invaders. Soldiers placed large wreaths in front of the main memorial as funereal music...", 
        "link": "http://www.reuters.com/article/us-china-japan-idUSKBN0TW03420151213"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "China claims almost all of the energy-rich waters of the South China Sea, through which more than $5 trillion of maritime trade passes each year. China periodically announces such exercises in the South China Sea, as it tries to demonstrate it is being transparent about its military deployments. Washington has criticized Beijing's building of artificial islands in the South China Sea's disputed Spratly archipelago, and has conducted sea and air patrols near them. Pictures on social media accounts of Chinese state media have in recent days shown pictures of Chinese navy ships engaged in live-fire exercises in the South China Sea, without saying where exactly they took place. China has been at odds with the United States of late over the strategic waterway.", 
        "title": "China navy carries out more drills in disputed South China Sea", 
        "summary": "China claims almost all of the energy-rich waters of the South China Sea, through which more than $5 trillion of maritime trade passes each year. China periodically announces such exercises in the South China Sea, as it tries to demonstrate it is bei...", 
        "link": "http://www.reuters.com/article/us-southchinasea-china-idUSKBN0TW01D20151213"
    }, 
    {
        "category": "life", 
        "website": "Reuters", 
        "all": "\"The packages got larger and larger and larger,\" Cullison said. Apartment managers \"are looking at the future, and they are only seeing more packages,\" said Rick Haughey, vice president of industry technology initiatives at the National Multifamily Housing Council, an industry group. \"The age that we live in, you know, folks prefer to shop online and have something come to their front door.\" Fed up with packages flooding its offices, Camden Property Trust, the 13th-biggest U.S. apartment owner, decided this year to refuse deliveries at its front desks. UPS is forecasting 630 million deliveries during the holiday season, up 43 percent from 2010.", 
        "title": "Online holiday package tsunami swamping U.S. apartment buildings", 
        "summary": "\"The packages got larger and larger and larger,\" Cullison said. Apartment managers \"are looking at the future, and they are only seeing more packages,\" said Rick Haughey, vice president of industry technology initiatives at the National Multifamily H...", 
        "link": "http://www.reuters.com/article/us-usa-apartments-packages-idUSKBN0TW0F220151213"
    }, 
    {
        "category": "life", 
        "website": "Reuters", 
        "all": "Leading British reviewer \"The World's 50 Best Restaurants\" only includes five French restaurants, with the first one - the Mirazur in Menton - at 11th place. The list is an initiative from the French foreign ministry's tourism council and will be presented by Foreign Minister Laurent Fabius on Thursday. French Chef Joel Robuchon attends the opening of the Taste Festival at the Grand Palais in Paris, France, May 21, 2015. \"The international rankings are not always transparent or objective and we observe that they have a bias towards playing down French gastronomy,\" said Florian Escudie, a French foreign ministry tourism advisor. La Liste includes 127 Japanese, 116 French, 97 American and 73 Chinese restaurants, as well as more than 50 Spanish and German establishments.", 
        "title": "French gastronomy strikes back with own top restaurants list", 
        "summary": "Leading British reviewer \"The World's 50 Best Restaurants\" only includes five French restaurants, with the first one - the Mirazur in Menton - at 11th place. The list is an initiative from the French foreign ministry's tourism council and will be pre...", 
        "link": "http://www.reuters.com/article/us-france-restaurants-list-idUSKBN0TV0FS20151213"
    }, 
    {
        "category": "tech", 
        "website": "Reuters", 
        "all": "British singer Adele's much-anticipated album \"25\" was withheld from streaming on digital music services, including Spotify, Apple Music and Deezer. Launched in June, Apple Music is Apple's attempt to carry its dominance of digital music through its iTunes store into the era of music streaming. Jackson cited music streaming services Spotify and Songza as examples of such competitors. But few think the iPhone maker will eclipse other music streaming companies. Swift said in June she would put her hit album \"1989\" on Apple Music, days after the tech giant bowed to pressure from Swift and some independent music groups and labels and agreed to pay artists during the free trial period for its music service.", 
        "title": "Apple Music wins exclusive video deal with Taylor Swift", 
        "summary": "British singer Adele's much-anticipated album \"25\" was withheld from streaming on digital music services, including Spotify, Apple Music and Deezer. Launched in June, Apple Music is Apple's attempt to carry its dominance of digital music through its ...", 
        "link": "http://www.reuters.com/article/us-apple-taylorswift-idUSKBN0TW0RT20151214"
    }, 
    {
        "category": "tech", 
        "website": "Reuters", 
        "all": "Apple introduced Apple Music in June. Swift said in June she would put her hit album \"1989\" on Apple Music, days after the tech giant bowed to pressure from Swift and some independent music groups and labels and agreed to pay artists during a free trial of its music service. Swift, who celebrated her 26th birthday on Sunday, tweeted a trailer for the concert video and said: \"Thank you so much for all the birthday wishes. An Apple logo hangs above the entrance to the Apple store on 5th Avenue in the Manhattan borough of New York City, July 21, 2015. Apple Chief Executive Tim Cook said in October the music streaming service had netted more than 6.5 million paid users, and that an additional 8.5 million people were participating in a free trial.", 
        "title": "Apple Music wins exclusive video deal with Taylor Swift", 
        "summary": "Apple introduced Apple Music in June. Swift said in June she would put her hit album \"1989\" on Apple Music, days after the tech giant bowed to pressure from Swift and some independent music groups and labels and agreed to pay artists during a free tr...", 
        "link": "http://www.reuters.com/article/us-apple-taylorswift-idUSKBN0TW0RT20151213"
    }, 
    {
        "category": "tech", 
        "website": "Reuters", 
        "all": "New York State Attorney General Eric Schneiderman speaks during a news conference in the Manhattan borough of New York August 21, 2014. The office launched an investigation into Verizon Communications Inc, Cablevision Systems Corp and Time Warner Cable Inc in October over the issue. All three companies have previously said they are confident in their Internet speeds and will work with the attorney general's office to provide the information requested and assist in the investigation. On Sunday, Schneiderman said he wanted feedback from the public to assist with the investigation. After the test is completed, he said he wants customers to submit a screenshot of the results and fill out an online form.New Yorkers should get the Internet speeds they pay for.", 
        "title": "New York attorney general solicits help from the public in broadband probe", 
        "summary": "New York State Attorney General Eric Schneiderman speaks during a news conference in the Manhattan borough of New York August 21, 2014. The office launched an investigation into Verizon Communications Inc, Cablevision Systems Corp and Time Warner Cab...", 
        "link": "http://www.reuters.com/article/us-new-york-attorney-probe-idUSKBN0TW0Q820151213"
    }, 
    {
        "category": "tech", 
        "website": "Reuters", 
        "all": "The European head of Facebook is under investigation in Germany over the social network's alleged failure to remove racist hate speech. The overnight attack on the social networking group was carried out by a group of 15-20 people wearing black clothes and hoods, police said in a statement. A 3D plastic representation of the Facebook logo is seen in this illustration in Zenica, Bosnia and Herzegovina, May 13, 2015. A Facebook spokesperson last month declined to comment on the investigation, adding \"we can say that the allegations lack merit and there has been no violation of German law by Facebook or its employees.\" Facebook has a partnership with a group called FSM, which monitors multimedia service providers on a voluntary basis, and has said it would encourage its users to push back against racism.", 
        "title": "Vandals attack Facebook building in Germany", 
        "summary": "The European head of Facebook is under investigation in Germany over the social network's alleged failure to remove racist hate speech. The overnight attack on the social networking group was carried out by a group of 15-20 people wearing black cloth...", 
        "link": "http://www.reuters.com/article/us-germany-facebook-idUSKBN0TW0LJ20151213"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "A man walks past a company logo outside a closed exchange centre of the Fanya Metal Exchange in downtown Kunming, Yunnan province, China, in this September 22, 2015 file photo. A woman walks past the company logo of the closed exchange centre of the Fanya Metal Exchange in downtown Kunming, Yunnan province, China, in this September 22, 2015 file photo. Investors said the \"Rijinbao\" scheme was advertised on state television and the Fanya exchange described itself as government-backed and regulated. Security guards blockedReuters from entering the Fanya exchange building. The Fanya Metals Exchange was launched shortly after China, the world's dominant producer of rare earths, imposed quotas on production and exports in a bid to support prices and attract downstream consumers to China.", 
        "title": "The China metal exchange at center of investment scandal", 
        "summary": "A man walks past a company logo outside a closed exchange centre of the Fanya Metal Exchange in downtown Kunming, Yunnan province, China, in this September 22, 2015 file photo. A woman walks past the company logo of the closed exchange centre of the ...", 
        "link": "http://www.reuters.com/article/us-china-metals-fanya-insight-idUSKBN0TX00K20151214"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "Copies of the South China Morning Post (SCMP) newspaper are seen on a newspaper stand in Hong Kong, China November 26, 2015. The South China Morning Post website and an image of Jack Ma, founder and executive chairman of Alibaba Group Holding Ltd, are displayed on a computer in Hong Kong, China, in this November 23, 2015 file photo illustration. SCMP Group had a turnover of around HK$1.2 billion in 2014, up slightly from 2013, it said.  In June, the company agreed to pay $194 million for an undisclosed stake in domestic financial media firm China Business News. The all-cash purchase, which follows a string of media deals by Alibaba, is likely to raise concerns in Hong Kong where the South China Morning Post occupies an important position and is seen as a barometer for press freedom under Chinese rule.", 
        "title": "Alibaba agrees on $266 million acquisition deal with South China Morning Post", 
        "summary": "Copies of the South China Morning Post (SCMP) newspaper are seen on a newspaper stand in Hong Kong, China November 26, 2015. The South China Morning Post website and an image of Jack Ma, founder and executive chairman of Alibaba Group Holding Ltd, ar...", 
        "link": "http://www.reuters.com/article/us-scmp-group-alibaba-idUSKBN0TX01S20151214"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "The collapse of Third Avenue's Focused Credit Fund jolted Wall Street and renewed worries about the difficulty of trading securities on the U.S. bond market. The blow-up of the Focused Credit Fund was the biggest mutual fund failure since the financial crisis. The redemptions and losses over the past year cut the size of the Third Avenue Focused Credit Fund to $789 million from nearly $3 billion. Third Avenue's Focused Credit Fund was overwhelmed with heavy losses and surging investor net withdrawals, forcing Barse to abruptly liquidate the fund and block redemptions. New York-based Third Avenue is a relatively small investment manager with fund assets that totaled $10 billion at the beginning of the year.", 
        "title": "Third Avenue parts with CEO after collapse of junk bond fund: WSJ", 
        "summary": "The collapse of Third Avenue's Focused Credit Fund jolted Wall Street and renewed worries about the difficulty of trading securities on the U.S. bond market. The blow-up of the Focused Credit Fund was the biggest mutual fund failure since the financi...", 
        "link": "http://www.reuters.com/article/us-funds-thirdavenue-ceo-idUSKBN0TW0U720151214"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "Directors on Dow's board defended the deal and Liveris in interviews, the WSJ reported. Loeb sent a private letter to Dow's board on Saturday raising questions about the timing of the deal, the WSJ reported, without disclosing how it knew the contents of the letter. Daniel S. Loeb, founder of Third Point LLC, participates in a panel discussion during the Skybridge Alternatives (SALT) Conference in Las Vegas, Nevada May 9, 2012. Loeb, who supports the merger, questioned whether the deal was rushed to be completed before the expiration of a standstill agreement this weekend that had barred him from publicly speaking about Dow, the WSJ reported. A Dow Chemical representative was not immediately available for comment to Reuters.", 
        "title": "Third Point's Loeb calls for removal of Dow Chemical chief Liveris: WSJ", 
        "summary": "Directors on Dow's board defended the deal and Liveris in interviews, the WSJ reported. Loeb sent a private letter to Dow's board on Saturday raising questions about the timing of the deal, the WSJ reported, without disclosing how it knew the content...", 
        "link": "http://www.reuters.com/article/us-thirdpoint-dowchemical-liveris-idUSKBN0TX00E20151214"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "A rate hike would be a first step toward normalizing monetary conditions after an extended period of loose policy, which had helped shore up risk assets. Oil prices continued their freefall after the International Energy Agency (IEA) warned that global oversupply of crude could worsen next year. Encouraging Chinese indicators released over the weekend did little to improve the mood as the backdrop of a shakeout in commodities markets and fitful global growth sapped risk appetite. For now, investors looked past better-than-expected Chinese indicators released over the weekend. On Friday, the Dow sank 1.8 percent and the S&P 500 lost 1.9 percent, as plunging crude prices added to investor nervousness before an expected first U.S. interest rate hike in nearly a decade.", 
        "title": "Stocks drop as oil rout keeps markets on edge before Fed", 
        "summary": "A rate hike would be a first step toward normalizing monetary conditions after an extended period of loose policy, which had helped shore up risk assets. Oil prices continued their freefall after the International Energy Agency (IEA) warned that glob...", 
        "link": "http://www.reuters.com/article/us-global-markets-idUSKBN0TX01D20151214"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "Covingtons attorney roster includes former Attorney General Eric Holder, and it has represented major drugmakers such as Johnson & Johnson and Pfizer. \"Valeant uses a variety of firms for legal and public relations work. Billionaire Bill Ackman, one of Valeants largest shareholders, has said the company made a \"meaningful mistake\" of underinvesting in public relations as it dealt with questions about its business practices. The headquarters of Valeant Pharmaceuticals International Inc., seen in Laval, Quebec November 9 2015. The move, confirmed by sources and through documents viewed by Reuters, signals a shift for Valeant Pharmaceuticals, which does not maintain a large presence on Capitol Hill.", 
        "title": "Valeant hires attorney, crisis management firm as U.S. scrutiny mounts", 
        "summary": "Covingtons attorney roster includes former Attorney General Eric Holder, and it has represented major drugmakers such as Johnson & Johnson and Pfizer. \"Valeant uses a variety of firms for legal and public relations work. Billionaire Bill Ackman, one ...", 
        "link": "http://www.reuters.com/article/us-valeant-hills-probes-idUSKBN0TW0Q420151213"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "For veterans of several Federal Reserve interest rate hike cycles, the last several years have presented something of an abnormal condition. Those who have seen several U.S. interest rate rise cycles think things are going to get more difficult. Traders work underneath a television screen showing Federal Reserve Chair Janet Yellen announcing that the Federal Reserve will leave interest rates unchanged on the floor of the New York Stock Exchange in New York September 17, 2015. In the few cases when the Fed has raised interest rates in similar conditions - 1958 and 1994, for instance - many of today's investors were not working on Wall Street. The Federal Reserve has raised rates many times before, but rarely and not recently in an era of tepid inflation and fairly expensive stocks.", 
        "title": "Wall Street veterans say rate-hike past is not prologue for markets", 
        "summary": "For veterans of several Federal Reserve interest rate hike cycles, the last several years have presented something of an abnormal condition. Those who have seen several U.S. interest rate rise cycles think things are going to get more difficult. Trad...", 
        "link": "http://www.reuters.com/article/us-usa-fed-markets-veterans-idUSKBN0TW0FR20151213"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "Jeff Swartz, policy director at the International Emissions Trading Association (IETA), said that showed CO2 emissions pricing would increase regardless of the final Paris deal. But Saturday's landmark agreement in Paris included an inelegant reference to what some analysts think could eventually build a bridge to a global CO2 emissions trading mechanism. In the immediate term, however, the EU's ETS - where CO2 emissions permits are languishing at around 8.50 euros per tonne - is not expected react strongly on Monday morning, traders said. \"I think we are going to see a multitude of approaches to CO2 pricing. But shortly after the deal, French President Francois Hollande said he would seek to build a coalition of countries that wanted to pursue a CO2 emissions price.", 
        "title": "For big business seeking CO2 emissions price, a ray of hope from Paris", 
        "summary": "Jeff Swartz, policy director at the International Emissions Trading Association (IETA), said that showed CO2 emissions pricing would increase regardless of the final Paris deal. But Saturday's landmark agreement in Paris included an inelegant referen...", 
        "link": "http://www.reuters.com/article/us-climatechange-summit-carbon-idUSKBN0TW07M20151213"
    }, 
    {
        "category": "politics", 
        "website": "Reuters", 
        "all": "\"I dont think he is qualified to be president,\" Trump said on \"Fox News Sunday.\" \"I don't think he has the right temperament. I don't think he's got the right judgment. I mean I could be saying anything and he'd say, I agree I agree,\" Trump said on CNN's \"State of the Union.\" Unlike the other Republicans in the 2016 White House race, the U.S. senator from Texas has embraced Trump and avoided public criticism of the popular candidate.", 
        "title": "As Cruz rises in presidential polls, Trump calls him 'maniac'", 
        "summary": "\"I dont think he is qualified to be president,\" Trump said on \"Fox News Sunday.\" \"I don't think he has the right temperament. I don't think he's got the right judgment. I mean I could be saying anything and he'd say, I agree I agree,\" Trump said on C...", 
        "link": "http://www.reuters.com/article/us-usa-election-idUSKBN0TW0M020151214"
    }, 
    {
        "category": "politics", 
        "website": "Reuters", 
        "all": "U.S. Republican presidential candidate and U.S. Senator Rand Paul speaks during a campaign stop at the Airport Diner in Manchester, New Hampshire September 2, 2015. Christie, following a surge in support in the early voting state of New Hampshire, will return to the prime-time debate after being bumped off it for a Fox Business debate last month, CNN said. Rand Paul, dipping in the latest opinion polls, had risked being placed with the lower-polling contenders in the large Republican field, which hold an earlier debate. Those include Mike Huckabee, the former Arkansas governor, former U.S. Senator Rick Santorum, former New York Governor George Pataki and U.S. Senator Lindsey Graham. Paul kept his spot thanks to a Fox News Iowa poll released Sunday that showed him strong enough in that state, according to CNN.Others on the main stage include Senator Marco Rubio, former Florida Governor Jeb Bush, businesswoman Carly Fiorina and Ohio Governor John Kasich, the network said.", 
        "title": "CNN adds Christie and Paul to presidential debate lineup", 
        "summary": "U.S. Republican presidential candidate and U.S. Senator Rand Paul speaks during a campaign stop at the Airport Diner in Manchester, New Hampshire September 2, 2015. Christie, following a surge in support in the early voting state of New Hampshire, wi...", 
        "link": "http://www.reuters.com/article/us-usa-election-debate-idUSKBN0TW0QC20151213"
    }, 
    {
        "category": "politics", 
        "website": "Reuters", 
        "all": "\"I dont think he is qualified to be president,\" Trump said on \"Fox News Sunday.\" \"I don't think he has the right temperament. I don't think he's got the right judgment. U.S. Senator Ted Cruz (R-TX) (R) greets businessman Donald Trump onstage as they address a Tea Party rally against the Iran nuclear deal at the U.S. Capitol in Washington September 9, 2015. Trump made the same point on Sunday, saying Americans are living in fear of being attacked.", 
        "title": "As Cruz rises in presidential polls, Trump calls him 'maniac'", 
        "summary": "\"I dont think he is qualified to be president,\" Trump said on \"Fox News Sunday.\" \"I don't think he has the right temperament. I don't think he's got the right judgment. U.S. Senator Ted Cruz (R-TX) (R) greets businessman Donald Trump onstage as they ...", 
        "link": "http://www.reuters.com/article/us-usa-election-idUSKBN0TW0M020151213"
    }, 
    {
        "category": "politics", 
        "website": "Reuters", 
        "all": "Obama has made combating global climate change a top priority of his presidency but has encountered stiff resistance to his proposals from Republicans in Congress. Over the past seven years, we've transformed the United States into the global leader in fighting climate change,\" Obama said. \"Too many people have spent their careers pretending that climate change is a hoax perpetrated by shadowy environmental groups and Machiavellian research scientists,\" Grijalva said. Unlike the Kyoto pact, forged with Democratic President Bill Clinton in office, the Paris agreement will not be a fully legally binding treaty, which would almost certainly fail to pass in the U.S. Congress. \"We cannot afford to be slowed by the climate skeptics or deterred by the defeatists who doubt America's ability to meet this challenge,\" Clinton said, vowing to make climate change a top priority if elected president.", 
        "title": "Obama calls Paris climate pact 'best chance' to save the planet", 
        "summary": "Obama has made combating global climate change a top priority of his presidency but has encountered stiff resistance to his proposals from Republicans in Congress. Over the past seven years, we've transformed the United States into the global leader ...", 
        "link": "http://www.reuters.com/article/us-climatechange-summit-usa-obama-idUSKBN0TV0SQ20151213"
    }, 
    {
        "category": "politics", 
        "website": "Reuters", 
        "all": "A sign (foreground) is seen after which the words 'Trump International Golf Club' were reaffixed after being removed on Thursday, at the AKOYA by DAMAC development in Dubai December 12, 2015. Gold letters spelling out \"Trump International Golf Club,\" affixed to a landscaped stone wall at the entrance to the golf complex being built by DAMAC Properties, were removed on Thursday, according to a Reuters photographer. A sign is seen after which the words 'Trump International Golf Club' were reaffixed after being removed on Thursday, at the AKOYA by DAMAC development in Dubai December 12, 2015. A combination picture (from Top to Bottom) shows the signboard, before the removal of the name 'Trump', after the removal, December 10, 2015, and subsequently reinstated name at the Trump International Golf Club portion at the AKOYA by DAMAC development in Dubai December 12,... Saudi billionaire Prince Alwaleed bin Talal, who bought an 85 meter luxury yacht from Trump in 1991, called him a disgrace to all America.", 
        "title": "Trump's name restored at Dubai golf complex", 
        "summary": "A sign (foreground) is seen after which the words 'Trump International Golf Club' were reaffixed after being removed on Thursday, at the AKOYA by DAMAC development in Dubai December 12, 2015. Gold letters spelling out \"Trump International Golf Club,\"...", 
        "link": "http://www.reuters.com/article/us-usa-election-trump-dubai-idUSKBN0TW06E20151213"
    }, 
    {
        "category": "politics", 
        "website": "Reuters", 
        "all": "Texas State Representative Sylvester Turner speaks during a meeting of the state legislature to consider legislation restricting abortion rights in Austin, Texas July 9, 2013.  Since about 2003, about 650,000 jobs have been created in the Houston area, according to the University of Houston. King encouraged the people of Houston to support the incoming mayor, adding that he had offered Turner his assistance in facing tough challenges. Since 1969, Houston has been one of the most successful major U.S. cities in terms of per capita personal income growth. With more than 210,000 votes cast, Turner claimed victory with 51 percent to 49 percent for King, who conceded defeat.", 
        "title": "Veteran lawmaker Sylvester Turner wins Houston mayoral runoff", 
        "summary": "Texas State Representative Sylvester Turner speaks during a meeting of the state legislature to consider legislation restricting abortion rights in Austin, Texas July 9, 2013.  Since about 2003, about 650,000 jobs have been created in the Houston are...", 
        "link": "http://www.reuters.com/article/us-houston-vote-idUSKBN0TV0GW20151213"
    }
]