[
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Most defectors fleeing isolated, repressive North Korea travel to South Korea via China and Southeast Asia, although it is possible to defect via Mongolia. North Korea has previously sentenced a Korean-American missionary, Kenneth Bae, to 15 years of hard labor but released him last year after holding him for two years. He had appeared on North Korean state media earlier this year confessing to crimes against the state. Both North Korea and neighboring China have clamped down on Christian groups in recent years. It freed a South Korean national with a U.S. green card in October this year after holding him for six months.", 
        "title": "North Korea sentences Canadian pastor to hard labor for life: Xinhua", 
        "summary": "Most defectors fleeing isolated, repressive North Korea travel to South Korea via China and Southeas...", 
        "link": "http://www.reuters.com/article/us-northkorea-canada-pastor-idUSKBN0TZ0CI20151216"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "\"We will not stay hand-tied but we will respond strongly towards the breaches that are taking place by the alliance and their mercenaries,\" Luqman said. The Saudi-led coalition spokesman, Brigadier General Ahmed al-Assiri, said the alliance was committed to the ceasefire but was ready to respond to any violation by the Houthis, according to the Saudi al-Riyadh daily. Luqman said strikes from the sea were taking place on the Red Sea port city of Hodaida, while ground forces continued to carry out attacks on Taiz city, in southwestern Yemen, while air strikes by the Arab coalition had not stopped. The agency quoted a medical source as saying 17 people were wounded. The Hadi-run sabanew.net news agency said five fighters from a force known as the Popular Resistance and three civilians died as a result of Houthi shelling in Taiz in the six hours after the ceasefire began.", 
        "title": "Yemen's Houthis, government trade accusation of truce violation", 
        "summary": "\"We will not stay hand-tied but we will respond strongly towards the breaches that are taking place ...", 
        "link": "http://www.reuters.com/article/us-yemen-security-idUSKBN0TY0OZ20151216"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Members of parliament attend a plenary session at the Cambodia National Assembly in Central Phnom Penh December 16, 2015. In Facebook comments on Tuesday, Sam Rainsy showed no signs of a change in tack. \"The question of when Sam Rainsy will be able to return would be easier to answer later.\" Sam Rainsy is also charged with forgery and incitement over a Facebook posting alleging Hun Sen's government had ceded border land to Vietnam. Kem Sokha (R), vice president of the Cambodia National Rescue Party is seen on a television screen, during a plenary session at the Cambodia National Assembly in Central Phnom Penh December 16, 2015.", 
        "title": "Cambodian opposition ends parliament boycott", 
        "summary": "Members of parliament attend a plenary session at the Cambodia National Assembly in Central Phnom Pe...", 
        "link": "http://www.reuters.com/article/us-cambodia-politics-idUSKBN0TZ08W20151216"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "Phipps said energy is attractive because of the \"extraordinary bearishness\" surrounding oil and energy stocks. At least seven of 25 strategists in a recent Reuters poll cited energy as their contrarian pick for 2016 or said they expect an upside surprise from oil and energy in 2016. Grohowski likes integrated oil companies for their dividends and oil services companies for the deals and restructuring, though he declined to name specific companies. S&P 500 energy sector earnings are forecast to fall 3.6 percent in 2016 compared with an estimated decline of 58.9 percent for the current year, according to Thomson Reuters data. His firm in October added an 8 percent allocation to one of its portfolios through the Energy Select Sector exchange-traded fund (XLE.P).", 
        "title": "For some on Wall Street, energy stocks are back in favor for 2016", 
        "summary": "Phipps said energy is attractive because of the \"extraordinary bearishness\" surrounding oil and ener...", 
        "link": "http://www.reuters.com/article/us-usa-energy-stocks-idUSKBN0TZ0J320151216"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "An Apple iphone 6 with Apple Pay is shown in this photo illustration in Encinitas , California June 3, 2015. In contrast, Apple remains locked in talks with big banks in search of a deal to accept Apple Pay. Android Pay has no such charges, the sources said. More than 60 percent of all card transactions in Australia are now contactless, ANZ bank said in a statement on Wednesday, announcing the Android Pay tie-up. Fees in Australia's lucrative mobile payments market remain a bone of contention in Apple's talks with the main banks.", 
        "title": "Australia banks agree Android Pay deal, Apple Pay still frozen out", 
        "summary": "An Apple iphone 6 with Apple Pay is shown in this photo illustration in Encinitas , California June ...", 
        "link": "http://www.reuters.com/article/us-australia-banking-google-idUSKBN0TY31I20151216"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "Valeant and Turing Pharmaceuticals have been under mounting U.S. government scrutiny over their practice of acquiring off-patent drugs and drastically hiking the prices. The hearing before the House Oversight Committee could be held as early as late January as part of an ongoing probe into sky rocketing drug prices, a Republican committee aide said. A Valeant spokeswoman said the company disagrees with many of his statements, and that it has provided information to the committee and will cooperate. Maryland Congressman Elijiah Cummings, the ranking Democrat on the House Oversight panel, has been among the most vocal critics of Valeant and Turing's pricing practices. Valeant recently hired Covington & Burling attorney Robert Kelner to manage the congressional inquiries, as well as a crisis public relations firm.", 
        "title": "U.S. House Democrats to seek testimony from Valeant in coming weeks", 
        "summary": "Valeant and Turing Pharmaceuticals have been under mounting U.S. government scrutiny over their prac...", 
        "link": "http://www.reuters.com/article/us-house-valeant-pharms-probe-idUSKBN0TZ0FW20151216"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "Supporting the greenback, Treasury yields rose overnight as gains on Wall Street reduced the appeal of safe-haven bonds and stable U.S. consumer price data reinforced the case for a Fed rate hike. Bank stocks, which will likely benefit from higher rates, were among the market leaders. It would be the first U.S. rate hike in nearly a decade, signaling the beginning of an end to an expansionary monetary policy that has supplied a tidal wave of liquidity to risk asset markets globally. On Wall Street Tuesday, the Dow .DJI added 0.9 percent and the S&P 500 .SPX advanced 1.1 percent. Japan's Nikkei .N225 surged 2.5 percent, rebounding from a two-month low struck the previous day as risk sentiment has blown hot and cold ahead of one of the most-anticipated market events this year.", 
        "title": "Asia surges as Wall Street gains lifts sentiment before Fed decision", 
        "summary": "Supporting the greenback, Treasury yields rose overnight as gains on Wall Street reduced the appeal ...", 
        "link": "http://www.reuters.com/article/us-global-markets-idUSKBN0TZ01L20151216"
    }, 
    {
        "category": "politics", 
        "website": "Reuters", 
        "all": "Ben Carson, businessman Donald Trump, Senator Ted Cruz, former Governor Jeb Bush, Governor Chris Christie and Senator Rand Paul pose before the start of... Republican U.S. presidential candidate businessman Donald Trump speaks during the Republican presidential debate in Las Vegas, Nevada December 15, 2015. Republican U.S. presidential candidate Senator Marco Rubio speaks during the Republican presidential debate in Las Vegas, Nevada December 15, 2015. Republican U.S. presidential candidate Governor Chris Christie speaks during the Republican presidential debate in Las Vegas, Nevada December 15, 2015. Decorations are seen behind the scenes at the U.S. Republican presidential debate in Las Vegas, Nevada December 15, 2015.", 
        "title": "Jeb Bush takes on Trump in U.S. debate, but other rivals resist", 
        "summary": "Ben Carson, businessman Donald Trump, Senator Ted Cruz, former Governor Jeb Bush, Governor Chris Chr...", 
        "link": "http://www.reuters.com/article/us-usa-election-debate-idUSKBN0TZ02220151216"
    }, 
    {
        "category": "politics", 
        "website": "Reuters", 
        "all": "A group of college students watch the Republican presidential debate at the Council on American-Islamic Relations (CAIR) office in Anaheim, California December 15, 2015. But Republican front-runner Donald Trumps comments about Muslims following this months fatal shooting spree at a San Bernardino holiday party left Elhanafy, 20, feeling he needed to watch the televised Republican debate on Tuesday night. University of California Riverside student Amal Ali, 22, watches the Republican presidential debate at the Council on American-Islamic Relations (CAIR) office in Anaheim, California December 15, 2015. University of California Irvine students Bushra Bangee (R), 19, and Huda Herwees, 19, watch the Republican presidential debate at the Council on American-Islamic Relations (CAIR) office in Anaheim, California December 15, 2015. University of California Riverside student Amal Ali (L), 22, and University of California Irvine student Huda Herwees, 19, watch the Republican presidential debate with other students at the Council on American-Islamic Relations (CAIR) office in Anaheim, California December...", 
        "title": "Near shooting site, views of Republican debate shaped by events", 
        "summary": "A group of college students watch the Republican presidential debate at the Council on American-Isla...", 
        "link": "http://www.reuters.com/article/us-usa-election-sanbernardino-idUSKBN0TZ0I520151216"
    }, 
    {
        "category": "politics", 
        "website": "Reuters", 
        "all": "And I'm going to be a Republican; I'm not going to be doing a third-party\" run. Republican U.S. presidential candidate and businessman Donald Trump speaks to the media in the spin room following the U.S. Republican presidential debate in Las Vegas, Nevada December 15, 2015. Trump has warned that he could renege on the promise if he felt the party's leadership had treated him unfairly. Trump told the newspaper he was concerned that he would be at a disadvantage if a contested convention materialized.  But Carson followed Trump's lead in the debate, saying Republican National Committee Chairman Reince Priebus had assured him the party would not try to thwart the process.", 
        "title": "Trump rules out third-party bid again", 
        "summary": "And I'm going to be a Republican; I'm not going to be doing a third-party\" run. Republican U.S. pres...", 
        "link": "http://www.reuters.com/article/us-usa-election-idUSKBN0TZ0HF20151216"
    }
]