[
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "It is the first such major arms sale to Taiwan in more than four years. China strongly opposes the U.S. arms sale to Taiwan,\" Xinhua quoted Vice Foreign Minister Zheng Zeguang, who summoned Lee, as saying. Past U.S. weapons sales to Taiwan have attracted strong condemnation in China, which considers Taiwan a renegade province. \"U.S. companies participating in arms sales to Taiwan gravely harm China's sovereignty and security interests,\" Foreign Ministry spokesman Hong Lei said. \"Our longstanding policy on arms sales to Taiwan has been consistent across six different U.S. administrations,\" a National Security Council spokesman, Myles Caggins, said.", 
        "title": "Obama administration authorizes $1.83-billion arms sale to Taiwan", 
        "summary": "It is the first such major arms sale to Taiwan in more than four years. China strongly opposes the U...", 
        "link": "http://www.reuters.com/article/us-usa-taiwan-arms-idUSKBN0TZ2C520151217"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "The PKK launched its insurgency in 1984 and more than 40,000 people have been killed in the conflict.  The PKK is designated as a terrorist group by Turkey, the United States and the European Union. Peace talks between its jailed leader Abdullah Ocalan and the state ground to a halt early this year. The PKK's three-decades-old insurgency flared up again in July after the collapse of a two-year ceasefire, leaving a peace process in tatters and plunging the mainly Kurdish southeast back into conflict. The towns of Cizre and Silopi, near the Syrian and Iraqi borders in the province of Sirnak, were placed under curfew on Monday as Turkey launched anti-PKK operations in which Turkish media says 10,000 police and troops are taking part.", 
        "title": "Turkey kills 23 Kurdish militants in southeast towns: state media", 
        "summary": "The PKK launched its insurgency in 1984 and more than 40,000 people have been killed in the conflict...", 
        "link": "http://www.reuters.com/article/us-turkey-kurds-idUSKBN0U00QE20151217"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "SEOUL A South Korean court found a Japanese journalist not guilty on Thursday of defaming President Park Geun-hye in a case that has inflamed the two countries' diplomatic ties and intensified questions about freedom of the press in South Korea.Tatsuya Kato, former bureau chief of Japan's Sankei Shimbun newspaper, was indicted last year for writing an article about Park that the prosecution said was based on \"false information.\"", 
        "title": "Japanese journalist cleared of defaming South Korea president", 
        "summary": "SEOUL A South Korean court found a Japanese journalist not guilty on Thursday of defaming President ...", 
        "link": "http://www.reuters.com/article/us-southkorea-japan-journalist-idUSKBN0U00TB20151217"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "The deal was brokered by local tribal leaders and had been expected to reflect positively on the peace talks in Switzerland. Peace talks began on Tuesday away from television cameras in Switzerland to try to end nearly nine months of fighting that has killed almost 6,000 people and displaced millions. Fikri al-Mutaili said the Houthis freed 265 residents of the former south Yemen while the Southern Resistance freed 300 Houthis, including 40 teenagers. The sources said that instead of direct talks, U.N. special envoy to Yemen, Ismail Ould Cheikh Ahmed, was shuttling between the two sides trying to bridge differences. In Marib, heavy fighting broke out east of the capital Sanaa overnight, and medics and tribal sources said that at least 15 people were killed from both sides.", 
        "title": "Yemen peace talks struggling in Switzerland amid disputes: sources", 
        "summary": "The deal was brokered by local tribal leaders and had been expected to reflect positively on the pea...", 
        "link": "http://www.reuters.com/article/us-yemen-security-idUSKBN0U00SQ20151217"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Vietnam, Malaysia, Brunei, the Philippines and Taiwan also claim parts of the South China Sea. China claims most of the South China Sea, through which more than $5 trillion of world trade ships every year, a fifth of it heading to and from U.S. ports. Australian Defense Minister Marise Payne speaks during a joint press availability at the 2015 Australia-U.S. Ministerial (AUSMIN) consultations in Boston, Massachusetts October 13, 2015. \"Australian military aircraft had better not regularly come to the South China Sea to add to the trouble, and especially not test China's patience by getting close to China's islands and reefs,\" it said in an editorial. China is building seven man-made islands on reefs in the Spratly Islands, including a 3,000-metre-long (10,000-foot) airstrip on one of the sites, according to satellite imagery.", 
        "title": "Australia says no plan to stop surveillance flights over South China Sea", 
        "summary": "Vietnam, Malaysia, Brunei, the Philippines and Taiwan also claim parts of the South China Sea. China...", 
        "link": "http://www.reuters.com/article/us-southchinasea-australia-surveillance-idUSKBN0U00I720151217"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "The 10,385 deadweight tonne (dwt) cargo freighter Thorco Cloud, operated by Danish shipper Thorco Shipping and registered in Antigua and Barbuda, had a crew of 12. The Singapore Strait, one of the world's busiest commercial shipping routes, is a 105-km long, 16-km wide passage between the Strait of Malacca to the South China Sea. Search and rescue operations continued for the six missing crew members, said an MPA spokesman in an update. Singapore's Police Coast Guard, supported by the Maritime and Port Authority of Singapore (MPA), rescued five of the crew members, while the chemical tanker picked up a sixth, the MPA said. Indonesian authorities have also commenced search and rescue operations and Singapore is ready to render assistance if required, the MPA said.", 
        "title": "Singapore Strait collision sinks freighter; six crew still missing", 
        "summary": "The 10,385 deadweight tonne (dwt) cargo freighter Thorco Cloud, operated by Danish shipper Thorco Sh...", 
        "link": "http://www.reuters.com/article/us-singapore-ship-sinking-idUSKBN0U00GZ20151217"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "BEIJING China's Foreign Ministry said on Thursday the government and Chinese companies would not cooperate with U.S. companies involved in selling Taiwan arms. The Obama administration formally notified Congress on Wednesday of a $1.83 billion arms sale package for self-ruled Taiwan, including two frigates, anti-tank missiles, amphibious assault vehicles and other equipment.", 
        "title": "China says no cooperation with U.S. firms selling Taiwan arms", 
        "summary": "BEIJING China's Foreign Ministry said on Thursday the government and Chinese companies would not coo...", 
        "link": "http://www.reuters.com/article/us-usa-taiwan-arms-china-idUSKBN0U00OU20151217"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "The Associated Press, citing unnamed officials, reported earlier on Wednesday that the United States and Cuba had reached \"an understanding\" on restoring commercial airline flights. Scheduled commercial flight service has been suspended for decades as a result of Cold War animosity, although charter flights have connected the countries in the interim. A formal deal has yet to be reached, the officials said. The market would grow further if the U.S. Congress were to lift either the tourism ban or the embargo. General U.S. tourism to the island remains banned by the U.S. trade embargo of Cuba.", 
        "title": "U.S., Cuba say making headway on restoring commercial flights", 
        "summary": "The Associated Press, citing unnamed officials, reported earlier on Wednesday that the United States...", 
        "link": "http://www.reuters.com/article/us-cuba-usa-aviation-report-idUSKBN0U002120151217"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "U.S. President Barack Obama and Cuban President Raul Castro meet at the United Nations General Assembly in New York September 29, 2015. \"The day that the president of the United States decides to visit Cuba, he will be welcome,\" Josefina Vidal, director of U.S. affairs in the Cuban foreign ministry, told reporters. It was a year ago that Obama and Cuban President Raul Castro shocked the world by announcing the former adversaries would normalize relations. Obama has about 400 days left in office before handing over to the next president, potentially a Republican hostile to his new Cuba policy. Since detente, Cuban overland arrivals to the United States have soared nearly 80 percent while the number arriving by sea has more than doubled.", 
        "title": "Cuba says Obama welcome to visit but not to meddle", 
        "summary": "U.S. President Barack Obama and Cuban President Raul Castro meet at the United Nations General Assem...", 
        "link": "http://www.reuters.com/article/us-cuba-usa-idUSKBN0U007U20151217"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "At the same time, we hope that the relevant laws and procedures of these countries are not abused by suspects,\" Liu said. \"But if any Chinese citizen breaks Chinese law, they will be investigated.\" Liu was asked about Ling Wancheng, the brother of Ling Jihua, a one-time senior aide to retired president Hu Jintao. \"Using this illegal money to defend their illegal actions is a challenge to justice and the law,\" Liu said. Liu said authorities had not found any case or complaint that repatriated people had been mistreated and Chinese law guaranteed torture would not be used.", 
        "title": "China says graft suspects abroad abuse system to prolong cases", 
        "summary": "At the same time, we hope that the relevant laws and procedures of these countries are not abused by...", 
        "link": "http://www.reuters.com/article/us-china-corruption-idUSKBN0U00IJ20151217"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Macau's Secretary for Economy and Finance met with representatives of the city's six casino operators for talks this week about enhancing Macau's economic competitiveness. Like Hong Kong, Macau is ruled under the one country-two systems model that affords its residents wide-ranging personal freedoms that don't exist on the mainland. Macau is the only place in China where its citizens are allowed to gamble in casinos. A visitor from Hong Kong takes a photo of Turbojet ferries upon her arrival in Macau October 10, 2012. China has been putting pressure on Macau, home to 37 casinos, to diversify away from an industry that brings in over 80 percent of government revenue.", 
        "title": "China more than triples Macau's size with new maritime jurisdiction", 
        "summary": "Macau's Secretary for Economy and Finance met with representatives of the city's six casino operator...", 
        "link": "http://www.reuters.com/article/us-macau-china-maritime-idUSKBN0U00I520151217"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "Army troops killed 13 rebels in the gun battle that erupted at 5 p.m. (4 a.m. Militants from the Abu Sayyaf group had steered clear of government troops on the islands of Jolo and Basilan since the beheading of a Malaysian restaurant owner last month. The al Qaeda-linked Abu Sayyaf, known for kidnappings, beheadings and bombings, are one of the most brutal Muslim rebel factions in the Muslim south of the largely Christian Philippines. MANILA Philippine troops clashed on Tuesday with Islamist militants on a remote southern island and 15 people were killed as security forces step up an offensive against rebels who beheaded a Malaysian captive, an army spokesman said. Although soldiers had been in the area since Sunday, Tan said, \"It was only today when the fighting got bigger.\"", 
        "title": "Philippine troops clash with Islamist militants, 15 dead", 
        "summary": "Army troops killed 13 rebels in the gun battle that erupted at 5 p.m. (4 a.m. Militants from the Abu...", 
        "link": "http://www.reuters.com/article/us-philippines-militants-idUSKBN0U00H320151217"
    }, 
    {
        "category": "world", 
        "website": "Reuters", 
        "all": "A man takes pictures of damage to cars following a rare tornado in the Sydney suburb of Kurnell, December 16, 2015. A truck lays overturned onto a car following strong winds at a Kurnell industrial park after a rare tornado hit the Sydney suburb December 16, 2015. A motorist assesses the damage to her car after a tornado hit the Sydney suburb of Kurnell, December 16, 2015. An emergency worker chainsaws a tree that destroyed a wall following a tornado in the Sydney suburb of Kurnell, December 16, 2015. A car sits among factory roof debris with its windows smashed alongside an oil refinery following a rare tornado in the Sydney suburb of Kurnell, December 16, 2015.", 
        "title": "Rare tornado rips through Sydney, damaging beachside suburbs", 
        "summary": "A man takes pictures of damage to cars following a rare tornado in the Sydney suburb of Kurnell, Dec...", 
        "link": "http://www.reuters.com/article/us-australia-storm-idUSKBN0TZ08O20151217"
    }, 
    {
        "category": "tech", 
        "website": "Reuters", 
        "all": "Since then, Facebook has beefed up the app's features by allowing users to send and receive money through Messenger. Logo of the Uber and Facebook are seen through magnifier on display in this illustration taken in Sarajevo, Bosnia and Herzegovina, December 16, 2015. Facebook has been aggressively working to boost the appeal of its messenger service, including making it mandatory last year for users to install a separate app to send and receive messages. Uber is the first partner for the Transportation on Messenger service, which will be available to select users in locations where Uber operates in the United States, Facebook said in a blog post. (bit.ly/1RSmDC8)Uber on Messenger will start rolling out in the United States on Wednesday, Uber said in a blog post. (ubr.to/1NqhKNh)Lyft, a rival ride-hailing service provider, will be added to Transportation on Messenger in January, sources close to Lyft told Reuters. \"Facebook is looking at this as a way to make Messenger more attractive,\" Thilo Koslowski, vice president and automotive practice leader of Gartner said.", 
        "title": "Facebook partners with Uber for ride-hailing service via Messenger", 
        "summary": "Since then, Facebook has beefed up the app's features by allowing users to send and receive money th...", 
        "link": "http://www.reuters.com/article/us-facebook-uber-idUSKBN0TZ2RX20151217"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "AstraZeneca will pay $2.5 billion upfront, with a further $1.5 billion paid either on receipt of the first regulatory approval for the medicine acalabrutinib or at the end of 2018, depending on which comes first. AstraZeneca believes the new medicine, which is now in final-stage testing, could sell more than $5 billion a year. Acalabrutinib is expected to be submitted for regulatory approval in the second half of 2016. A sign is seen at an AstraZeneca site in Macclesfield, central England in this May 19, 2014 file photo. Last month he agreed to buy ZS Pharma (ZSPH.O), a specialist in treating high potassium levels, for $2.7 billion.", 
        "title": "AstraZeneca buys most of Acerta for $4 billion to add cancer drug", 
        "summary": "AstraZeneca will pay $2.5 billion upfront, with a further $1.5 billion paid either on receipt of the...", 
        "link": "http://www.reuters.com/article/us-acerta-m-a-astrazeneca-idUSKBN0U00QM20151217"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "Russia's Deputy Finance Minister Sergei Storchak arrives for the G-20 Finance Ministers Meeting during the World Bank/IMF Annual Meeting in Washington October 10, 2014. BEIJING The International Monetary Fund's decision on Ukraine's debt to Russia did not change anything to Moscow, Russian Deputy Finance Minister Sergei Storchak told reporters in Beijing on Thursday. The International Monetary Fund's Executive Board decided this week that a claim from a $3 billion Eurobond issued by Ukraine in December 2013 and held by Russia is an official claim.", 
        "title": "Russia says IMF's decision on Ukraine debt changes nothing", 
        "summary": "Russia's Deputy Finance Minister Sergei Storchak arrives for the G-20 Finance Ministers Meeting duri...", 
        "link": "http://www.reuters.com/article/us-ukraine-crisis-russia-debt-idUSKBN0U00SI20151217"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "KIEV Ukraine's Finance Ministry said on Thursday it was committed to negotiating in good faith a restructuring of a $3 billion Eurobond held entirely by Russia, after the International Monetary Fund ruled the bond was sovereign rather than private debt. In a statement, the ministry repeated it would not repay the bond in full when it matures on Dec. 20. However, \"Ukraine remains committed to negotiating in good faith a consensual restructuring ...which will allow it to remain in compliance with the financing targets agreed with the IMF,\" it said.", 
        "title": "Ukraine says committed to good faith talks with Russia on $3 billion bond", 
        "summary": "KIEV Ukraine's Finance Ministry said on Thursday it was committed to negotiating in good faith a res...", 
        "link": "http://www.reuters.com/article/us-ukraine-crisis-debt-idUSKBN0U00SS20151217"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "\"Last night's inventory data from the U.S. was clearly unsettling,\" said Ric Spooner, chief market analyst at CMC Markets in Sydney, adding the Fed's rate hike was also behind the falls. Higher U.S. rates typically support the dollar, making oil and other commodities denominated in the greenback more expensive, undermining demand. Ending the four-decade ban on most exports of crude oil, would end a years-long fight prompted by the boom in shale output that has already contributed to the supply glut. Brent crude for February delivery LCOc1, the front-month contract from Thursday, fell 12 cents to $37.27. U.S. crude stocks increased last week as imports into the Gulf Coast rose, data from the Energy Information Administration (EIA) showed on Wednesday, surprising analysts who expected inventories to decline.", 
        "title": "Crude falls after U.S. Fed rate hike, inventory gains", 
        "summary": "\"Last night's inventory data from the U.S. was clearly unsettling,\" said Ric Spooner, chief market a...", 
        "link": "http://www.reuters.com/article/us-global-oil-idUSKBN0U004S20151217"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "\"The Fed's hike will stiffen the headwinds for growth in Asia,\" said Fred Neumann, HSBC's chief Asia economist. And despite the Fed hike, policy in much of Asia is set to loosen further in a reflection of the fitful growth in the region. \"The Fed's action brings an end to the lift-off uncertainty,\" said Amando Tetangco, the governor of the Philippine central bank as he prepared to chair the monetary policy meeting later on Thursday. Others, however, cautioned that higher interest rates would pose problems for economies that were too reliant on debt-fueled growth. This is to counter the effects of the trade recession, which hits Asia disproportionately harder than any other region in the world.\"", 
        "title": "Asia policymakers spared Fed jolt, look to support shaky economies", 
        "summary": "\"The Fed's hike will stiffen the headwinds for growth in Asia,\" said Fred Neumann, HSBC's chief Asia...", 
        "link": "http://www.reuters.com/article/us-global-economy-asia-idUSKBN0U00AI20151217"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "Representatives of Avon, Barington and Cerberus were not immediately available for comment outside regular U.S. business hours. As part of the deal, Cerberus will designate a new chairman and also take three seats on Avon's board along with naming two new independent directors, the Journal said. The potential deal comes at a time when investors led by Barington Capital have proposed a restructuring of Avon, saying the cosmetics maker is \"significantly undervalued\" and warning against the sale of its North American arm to Cerberus Capital Management. New York-based Cerberus will also invest $435 million for a nearly 17 percent stake in the parent company, the paper reported, citing people familiar with the matter. The Avon Products headquarters is seen in midtown Manhattan area of New York, in this June 21, 2013 file photo.", 
        "title": "Cerberus nears deal to buy Avon's North American business: WSJ", 
        "summary": "Representatives of Avon, Barington and Cerberus were not immediately available for comment outside r...", 
        "link": "http://www.reuters.com/article/us-avon-prdcts-divestiture-cerberus-capi-idUSKBN0U00KX20151217"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "Google paid A$9 million tax on A$91 million in taxable income, a third of the company tax rate and dwarfed by the A$357 million it made. \"Individual company tax laws haven't really come to terms with that yet, and Australia is probably well ahead of the pack rather than behind it,\" Burn said. It also could build public support for an overhaul to the company tax system after a high-profile government inquiry into corporate tax avoidance earlier this year saw some tense clashes between executives and lawmakers. A BAE Systems spokeswoman said the company paid no income tax that year because of losses it incurred developing a new surveillance system for the Royal Australian Air Force. For all but SABMiller, the zero annual tax payment came despite reporting taxable income.", 
        "title": "Australian tax office names names in multinational avoidance row", 
        "summary": "Google paid A$9 million tax on A$91 million in taxable income, a third of the company tax rate and d...", 
        "link": "http://www.reuters.com/article/us-australia-tax-idUSKBN0U00M320151217"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "Investors holding about 43 percent of Shell's shares also hold 53 percent of BG, according to Reuters data. The Anglo-Dutch company has announced further cost savings and job cuts for when the deal is completed, which it said would allow it to cope with a low oil price environment. To pass, a majority of voting BG shareholders, who also represent at least 75 percent of the outstanding shares, must approve the deal. Add to that the fall of Petrobras and you have even more of the world's best upstream assets falling into Shell's lap.\" Like its rivals, Shell slashed its 2015 spending by about 20 percent, cut thousands of jobs, delayed or scrapped huge projects and increased borrowing in the face of the oil price slump, but maintained its dividend payouts.", 
        "title": "Oil price slide unlikely to scuttle Shell's takeover of BG", 
        "summary": "Investors holding about 43 percent of Shell's shares also hold 53 percent of BG, according to Reuter...", 
        "link": "http://www.reuters.com/article/us-bg-m-a-shell-investors-idUSKBN0U00LR20151217"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "While yields on two-year notes US2YT=RR hit their highest since April 2010, they were only up four basis points in all at 1.009 percent. Still, that did widen the premium over German yields DE2YT=RR to 132 basis points, the fattest since late 2006 and a positive draw for the U.S. dollar. Richard Franulovich, a currency strategist at Westpac, noted that historically the dollar tended to soften at the start of Fed tightening cycles. Markets were soothed by Fed Chair Janet Yellen's assurance that future tightening would be \"gradual\" and dependent on inflation finally moving higher as long forecast. This steady decline puts pressure in turn on other Asian currencies to depreciate to stay competitive.", 
        "title": "Asian stocks, dollar, climb as Fed takes a first step", 
        "summary": "While yields on two-year notes US2YT=RR hit their highest since April 2010, they were only up four b...", 
        "link": "http://www.reuters.com/article/us-global-markets-idUSKBN0TZ36120151217"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "Officials from Fed Chair Janet Yellen down do have regular contact with Chinese central bankers and other government officials. Former and current Fed officials say there is no official hotline with China, although there is formal interaction. Both the Fed and the European Central Bank have small but growing cadres of analysts who specialize in China. A man reads newspaper in front of an electronic board showing stock information at a brokerage house in Beijing, China, December 17, 2015. Neither does the People's Bank of China send policymakers to international economic meetings where they could mingle with top officials from the Fed, ECB, BOJ and other central banks.", 
        "title": "As Fed fog lifts, central bankers keep puzzling over China", 
        "summary": "Officials from Fed Chair Janet Yellen down do have regular contact with Chinese central bankers and ...", 
        "link": "http://www.reuters.com/article/us-usa-fed-china-insight-idUSKBN0U00JI20151217"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "NEW DELHI The U.S. Federal Reserve's \"accommodative\" monetary stance is good for emerging market economies, and India does not expect to see large foreign selling from the country, India's economic affairs secretary Shaktikanta Das said on Thursday. The Fed hiked interest rates for the first time in nearly a decade on Wednesday, while saying its monetary policy would remain \"accommodative\" as the U.S. central bank pursues a \"gradual\" tightening cycle. \"We are well prepared to deal with such external development,\" Das told reporters.\"(The) country is benefiting from low crude prices and overall macro-economic stability is also there.\"", 
        "title": "India fin min official: Fed's accommodative stance good for emerging markets", 
        "summary": "NEW DELHI The U.S. Federal Reserve's \"accommodative\" monetary stance is good for emerging market eco...", 
        "link": "http://www.reuters.com/article/us-india-finmin-economy-fed-idUSKBN0U00GE20151217"
    }, 
    {
        "category": "business", 
        "website": "Reuters", 
        "all": "JAKARTA Indonesian president Joko Widodo said the U.S. Federal Reserve's interest rate hike is positive for the country as it creates certainty in financial markets. \"This is good, because there is certainty,\" Widodo told reporters on Thursday. \"The effect is positive for us - the stock index rose, the rupiah strengthened, the financial market reacted positively.\" Indonesia's benchmark stock index .JKSE rose more than 1 percent on Thursday, while the rupiah IDR= strengthened slightly.", 
        "title": "Indonesian president says Fed rate hike is positive for the country", 
        "summary": "JAKARTA Indonesian president Joko Widodo said the U.S. Federal Reserve's interest rate hike is posit...", 
        "link": "http://www.reuters.com/article/us-indonesia-economy-fed-idUSKBN0U00GC20151217"
    }, 
    {
        "category": "politics", 
        "website": "Reuters", 
        "all": "It is the first such major arms sale to Taiwan in more than four years. China strongly opposes the U.S. arms sale to Taiwan,\" Xinhua quoted Vice Foreign Minister Zheng Zeguang, who summoned Lee, as saying. Past U.S. weapons sales to Taiwan have attracted strong condemnation in China, which considers Taiwan a renegade province. \"U.S. companies participating in arms sales to Taiwan gravely harm China's sovereignty and security interests,\" Foreign Ministry spokesman Hong Lei said. \"Our longstanding policy on arms sales to Taiwan has been consistent across six different U.S. administrations,\" a National Security Council spokesman, Myles Caggins, said.", 
        "title": "Obama administration authorizes $1.83-billion arms sale to Taiwan", 
        "summary": "It is the first such major arms sale to Taiwan in more than four years. China strongly opposes the U...", 
        "link": "http://www.reuters.com/article/us-usa-taiwan-arms-idUSKBN0TZ2C520151217"
    }, 
    {
        "category": "politics", 
        "website": "Reuters", 
        "all": "BEIJING China's Foreign Ministry said on Thursday the government and Chinese companies would not cooperate with U.S. companies involved in selling Taiwan arms. The Obama administration formally notified Congress on Wednesday of a $1.83 billion arms sale package for self-ruled Taiwan, including two frigates, anti-tank missiles, amphibious assault vehicles and other equipment.", 
        "title": "China says no cooperation with U.S. firms selling Taiwan arms", 
        "summary": "BEIJING China's Foreign Ministry said on Thursday the government and Chinese companies would not coo...", 
        "link": "http://www.reuters.com/article/us-usa-taiwan-arms-china-idUSKBN0U00OU20151217"
    }, 
    {
        "category": "politics", 
        "website": "Reuters", 
        "all": "The Associated Press, citing unnamed officials, reported earlier on Wednesday that the United States and Cuba had reached \"an understanding\" on restoring commercial airline flights. Scheduled commercial flight service has been suspended for decades as a result of Cold War animosity, although charter flights have connected the countries in the interim. A formal deal has yet to be reached, the officials said. The market would grow further if the U.S. Congress were to lift either the tourism ban or the embargo. General U.S. tourism to the island remains banned by the U.S. trade embargo of Cuba.", 
        "title": "U.S., Cuba say making headway on restoring commercial flights", 
        "summary": "The Associated Press, citing unnamed officials, reported earlier on Wednesday that the United States...", 
        "link": "http://www.reuters.com/article/us-cuba-usa-aviation-report-idUSKBN0U002120151217"
    }, 
    {
        "category": "politics", 
        "website": "Reuters", 
        "all": "U.S. President Barack Obama and Cuban President Raul Castro meet at the United Nations General Assembly in New York September 29, 2015. \"The day that the president of the United States decides to visit Cuba, he will be welcome,\" Josefina Vidal, director of U.S. affairs in the Cuban foreign ministry, told reporters. It was a year ago that Obama and Cuban President Raul Castro shocked the world by announcing the former adversaries would normalize relations. Obama has about 400 days left in office before handing over to the next president, potentially a Republican hostile to his new Cuba policy. Since detente, Cuban overland arrivals to the United States have soared nearly 80 percent while the number arriving by sea has more than doubled.", 
        "title": "Cuba says Obama welcome to visit but not to meddle", 
        "summary": "U.S. President Barack Obama and Cuban President Raul Castro meet at the United Nations General Assem...", 
        "link": "http://www.reuters.com/article/us-cuba-usa-idUSKBN0U007U20151217"
    }
]